// problems10.js
export const problemsByPack789 = {
  "physics__10AU": [
    "Простой процесс",
    "Необычный график",
    "Азот"
  ],
  "physics__10Entropy": [
    "Энтропия процесса",
    "КПД через энтропию"
  ],
  "physics__10G": [
    "На экране",
    "Увеличение среднего",
    "Таракашка"
  ],
  "physics__10KK": [
    "Критерий уменьшения",
    "Критическая точка",
    "Изменение кипения"
  ],
  "physics__10Tkarno": [
    "Рабочий пар"
  ],
  "physics__10adiabatic": [
    "По молю гелия",
    "Малое изменение",
    "Два гелия"
  ],
  "physics__10conduct": [
    "Шар в однородном поле",
    "Незаряженный шар",
    "Сферический проводник",
    "Притягивающиеся половинки"
  ],
  "physics__10cycle": [
    "Оптимальный прямоугольник",
    "Изо-цикл",
    "Соединённые циклы",
    "Треугольный цикл"
  ],
  "physics__10epsilon": [
    "Энергия в веществе",
    "Сила в конденсаторе"
  ],
  "physics__10equilibrium": [
    "Улёт заряда",
    "Жидкая деревяшка"
  ],
  "physics__10ftl": [
    "Совпадающие изображения",
    "Три точки",
    "Две перестановки"
  ],
  "physics__10gauss": [
    "Рассчёт полей",
    "Выталкивание грани",
    "Радиальное поле",
    "Поле отрезка"
  ],
  "physics__10humid": [
    "Начальная влажность",
    "Пружина и влажность",
    "Влажный воздух"
  ],
  "physics__10image": [
    "Изображение стержня",
    "Прямой уголок"
  ],
  "physics__10karno": [
    "Теплопотери дома",
    "Части работы",
    "Граничный цикл"
  ],
  "physics__10klapmend": [
    "Манометр",
    "Раздельный сосуд",
    "Минимальная плотность"
  ],
  "physics__10klau": [
    "Минимальная работа"
  ],
  "physics__10klin": [
    "Смещение в пластине",
    "Двойная призма",
    "Мини-призма"
  ],
  "physics__10lambda": [
    "Чужой газ"
  ],
  "physics__10lens": [
    "Поиск луча",
    "Поиск линзы",
    "Изображение без линзы",
    "Четыре звезды"
  ],
  "physics__10log": [
    "Логарифмические махинации",
    "Экспоненциальная производная"
  ],
  "physics__10mirror": [
    "На складе",
    "Вращающееся зеркало",
    "Муравей и зеркало"
  ],
  "physics__10politropa": [
    "Степень объёма",
    "Большая работа"
  ],
  "physics__10pvo": [
    "4",
    "Оптическая планета",
    "Оптическая вращалка"
  ],
  "physics__10qen": [
    "Полусфера",
    "Кубик",
    "Конус",
    "Металлическая сфера"
  ],
  "physics__10reflection": [
    "Призма на воде",
    "Преломление в шаре",
    "Прозрачный слой",
    "Толстая линза"
  ],
  "physics__10shadow": [
    "Тень палки",
    "Тень парня"
  ],
  "physics__10small": [
    "Погрешность",
    "Ряд деления",
    "Корень из ряда"
  ],
  "physics__10system": [
    "Система сил"
  ],
  "physics__10tel": [
    "Грани",
    "Цилиндры"
  ],
  "physics__10turelec": [
    "Полусферы",
    "Электрический стержень",
    "Мудрый проводник",
    "Мини-проводник",
    "Изображение маятника"
  ],
  "physics__10turopt": [
    "Прозрачный шар",
    "Чертеж в шкафу",
    "Взгляд из торца",
    "Сферическая среда",
    "Микроавтомобиль"
  ],
  "physics__10turterm": [
    "Временной процесс",
    "Гиря на сосуде",
    "Ромбик",
    "Влажный воздух",
    "График теплоёмкости"
  ],
  "physics__10vdv": [
    "Клаузиус",
    "Ван-дер-Ваальс"
  ]
};
