export const rawNodes = [
  {
    "id": "TheSolution",
    "data": {
      "section": "",
      "grade": "11",
      "number": 1,
      "problems": []
    },
    "position": {
      "x": 8020,
      "y": -520
    },
    "width": 600,
    "height": 400
  },
  {
    "id": "Равномерное прямолинейное движение",
    "data": {
      "section": "механика",
      "grade": "7",
      "text": "Равномерное прямолинейное движение, скорость, координата, перемещение, график зависимости, вектор, время движения, пример",
      "number": 2,
      "olympiads": [
        "МОШ, 7-8",
        "Росатом, 7-10",
        "Курчатов, 7-8",
        "Ломоносов, 7-9"
      ],
      "problems": [
        {
          "name": "Почти Феррари"
        },
        {
          "name": "Длинный поезд"
        },
        {
          "name": "График x(t)"
        }
      ]
    },
    "position": {
      "x": 4420,
      "y": 540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Плотность",
    "data": {
      "section": "механика",
      "grade": "7",
      "text": "Инерция, инертность, масса, плотность, формула плотности, средняя плотность, общая масса, общий объём, примеры, физические величины, свойства вещества, единицы измерения",
      "number": 3,
      "olympiads": [
        "МОШ, 7-8",
        "Росатом, 8-9",
        "Курчатов, 7-8",
        "Ломоносов, 7-9"
      ],
      "problems": [
        {
          "name": "Бревно"
        },
        {
          "name": "Кубики"
        },
        {
          "name": "Сплавили"
        },
        {
          "name": "Полый шар"
        },
        {
          "name": "Плотность меняется?"
        }
      ]
    },
    "position": {
      "x": 4980,
      "y": 540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа с графиками",
    "data": {
      "section": "математика",
      "grade": "7",
      "number": 4,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 7-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Максимальная скорость"
        },
        {
          "name": "Скорость от пути"
        },
        {
          "name": "Максимальное опережение"
        },
        {
          "name": "Средняя скорость от пути"
        }
      ],
      "text": "Линейные функции, наклон прямой, угловой коэффициент, смещение, приращения, мгновенная скорость, секущая, касательная, график зависимости, изменение координаты, перемещение"
    },
    "position": {
      "x": 8260,
      "y": 560
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Электрический заряд. Закон Кулона.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 5,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Изменение параметров"
        },
        {
          "name": "Суммарная сила"
        }
      ],
      "text": "Электрический заряд, положительный заряд, отрицательный заряд, протоны, электроны, элементарный заряд, закон Кулона, взаимодействие зарядов, сила взаимодействия, расстояние"
    },
    "position": {
      "x": 6760,
      "y": 560
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Температура. Связь температуры с кинетической энергией движения молекул.",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 6,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Гелий и аргон"
        },
        {
          "name": "Нагревание газа"
        },
        {
          "name": "Средний квадрат"
        }
      ],
      "text": "температура, молекулы, кинетическая энергия, средняя кинетическая энергия, скорость, абсолютная температура, постоянная Больцмана, энергия, нулевая точка, Цельсий, Кельвин"
    },
    "position": {
      "x": 11040,
      "y": 560
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тень. Полутень.",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 7,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 10-11",
        "Курчатов, 8-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Тень палки"
        },
        {
          "name": "Тень парня"
        }
      ],
      "text": "Свет, электромагнитное излучение, геометрическая оптика, поток энергии, прозрачная среда, прямые линии, лучи, показатель преломления, скорость света, источник света"
    },
    "position": {
      "x": 9620,
      "y": 560
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Средняя скорость. Относительное движение.",
    "data": {
      "section": "механика",
      "grade": "7",
      "text": "Средняя скорость, перемещение, путь, средняя скорость по перемещению, среднепутевая скорость, движение «туда–обратно», полный путь, общее время, относительное движение",
      "number": 8,
      "olympiads": [
        "МОШ, 7-8",
        "Росатом, 7-9",
        "Курчатов, 7",
        "Физтех, 8",
        "Ломоносов, 7-9"
      ],
      "problems": [
        {
          "name": "Половинки"
        },
        {
          "name": "Катер"
        },
        {
          "name": "Плывем по течению"
        },
        {
          "name": "Смотрите под ноги"
        },
        {
          "name": "Бег по кругу"
        },
        {
          "name": "График средней скорости от пути"
        },
        {
          "name": "Бездорожье"
        }
      ]
    },
    "position": {
      "x": 4420,
      "y": 820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Кинематические связи. Блоки.",
    "data": {
      "section": "механика",
      "text": "Неподвижный блок, нерастяжимая нить, перемещения концов, длина нити, связь скоростей, кинематическая связь, подвижный блок, система с подвижным блоком, полная длина нити",
      "grade": "7",
      "number": 9,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 9-11",
        "Курчатов, 8-11",
        "Физтех, 9-10",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Нить на блоке"
        },
        {
          "name": "Эвакуатор"
        },
        {
          "name": "Большая система блоков"
        }
      ]
    },
    "position": {
      "x": 4420,
      "y": 1100
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Закон Гука. Системы пружин.",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 10,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 7-11",
        "Курчатов, 7-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Растяжка"
        },
        {
          "name": "2 пружины последовательно"
        },
        {
          "name": "Теперь параллельно"
        },
        {
          "name": "2 хорошо, а 3 лучше"
        },
        {
          "name": "Разрезали поровну"
        },
        {
          "name": "Увеличиваем жесткость"
        }
      ],
      "text": "Деформация, изменение формы, изменение размера, пружина, удлинение, сжатие, закон Гука, сила упругости, жёсткость пружины, коэффициент упругости, параллельное соединение"
    },
    "position": {
      "x": 4420,
      "y": 1420
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила. Третий закон Ньютона.",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 11,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 7-11",
        "Курчатов, 7-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Перетягивание каната"
        }
      ],
      "text": "Сила, третий закон Ньютона, вектор силы, ньютоны, равнодействующая сила, система сил, правило параллелограмма, покой тела, второй закон Ньютона, равнодействующая всех сил"
    },
    "position": {
      "x": 4980,
      "y": 820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила тяжести",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 12,
      "problems": [
        {
          "name": "Вес"
        },
        {
          "name": "Нормальная реакция"
        },
        {
          "name": "Шары притягиваются"
        },
        {
          "name": "Лунная гравитация"
        },
        {
          "name": "Солнце и земля"
        }
      ],
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 7-11",
        "Курчатов, 7-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "text": "Гравитация, сила тяжести, закон всемирного тяготения, модуль силы притяжения, гравитационная постоянная, массы тел, расстояние между телами, ускорение свободного падения"
    },
    "position": {
      "x": 4980,
      "y": 1100
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Трение",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 13,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 9-11",
        "Курчатов, 7-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Куда везем мы кирпичи"
        },
        {
          "name": "Никак не сдвинуть"
        },
        {
          "name": "Снова ящик"
        },
        {
          "name": "Зажали"
        }
      ],
      "text": "Сила трения, касательная сила, микронеровности, нормальная реакция, закон Амонтона-Кулона, максимальная сила трения, коэффициент трения покоя, коэффициент трения скольжения"
    },
    "position": {
      "x": 5560,
      "y": 1800
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Моменты",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 14,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 7-11",
        "Курчатов, 7-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Равновесие"
        },
        {
          "name": "Груз на палке"
        },
        {
          "name": "Скизифова улитка"
        },
        {
          "name": "Соломинка"
        },
        {
          "name": "Рычаг блок и нить"
        }
      ],
      "text": "Момент силы, точка опоры, плечо силы, равновесие, поступательное движение, вращение, силы, условия равновесия, однородный рычаг, теорема о трёх силах, линии действия, пересечение"
    },
    "position": {
      "x": 4420,
      "y": 1780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа. Мощность. КПД",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 15,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Работа крана"
        },
        {
          "name": "День на стройке"
        },
        {
          "name": "Полезный блок"
        }
      ],
      "text": "Работа силы, перемещение, модуль силы, джоуль, мощность, коэффициент полезного действия, КПД, полезная работа, затраченная работа, трение, деформация, сопротивление среды"
    },
    "position": {
      "x": 4660,
      "y": 2180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Системы блоков. Статика со связями.",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 16,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 9-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Два блока"
        },
        {
          "name": "Змейкой"
        },
        {
          "name": "Ограниченное равновесие"
        },
        {
          "name": "Лесенка"
        },
        {
          "name": "Намудрили"
        }
      ],
      "text": "легкий блок, жесткое колесо, радиус, неподвижная ось, нить, грузы, силы натяжения, равновесие блока, сумма моментов, натяжение нити, центральная нить, боковые нити"
    },
    "position": {
      "x": 4180,
      "y": 2180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Давление. Сообщающиеся сосуды",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 17,
      "olympiads": [
        "МОШ, 7-9",
        "Росатом, 9",
        "Курчатов, 7-8",
        "Ломоносов, 7-9"
      ],
      "problems": [
        {
          "name": "Давление мальчика"
        },
        {
          "name": "Большой столб"
        },
        {
          "name": "Масло и водица"
        },
        {
          "name": "Давить на воду"
        },
        {
          "name": "Намудрили"
        },
        {
          "name": "Пластилин на дне"
        }
      ],
      "text": "Давление, физическая величина, сила, площадь, паскали, закон Паскаля, изменение давления, несжимаемая жидкость, газ, сосуд, поршень, глубина, вес, столб вещества, сила тяжести"
    },
    "position": {
      "x": 4980,
      "y": 1600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила Архимеда",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 18,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 7-11",
        "Курчатов, 7-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Шар повесили"
        },
        {
          "name": "Топим пластилином"
        },
        {
          "name": "На границе"
        },
        {
          "name": "Куб не тонет"
        },
        {
          "name": "Поплыли"
        },
        {
          "name": "Ледяные весы"
        }
      ],
      "text": "Сила Архимеда, давление жидкости, кубик, погружение, равнодействующая, подъёмная сила, закон Архимеда, произвольное тело, вымещение, объём, форма, кусок жидкости"
    },
    "position": {
      "x": 4980,
      "y": 1960
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Механика, 7 класс.",
    "data": {
      "section": "механика",
      "grade": "7",
      "number": 19,
      "problems": [
        {
          "name": "Потерянная информация"
        },
        {
          "name": "Сила на дно"
        },
        {
          "name": "Перемещение груза"
        },
        {
          "name": "Люди на рычагах"
        },
        {
          "name": "Смещение груза"
        }
      ]
    },
    "position": {
      "x": 4760,
      "y": 2900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия",
    "data": {
      "section": "механика",
      "grade": "8",
      "number": 20,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Грузы на блоке"
        },
        {
          "name": "Работа на растяжение"
        },
        {
          "name": "Скорость бруска"
        }
      ],
      "text": "Кинетическая энергия, Работа силы, Теорема о кинетической энергии, Потенциальная энергия, Закон сохранения механической энергии, Масса, Скорость, Сила, Перемещение, Угол"
    },
    "position": {
      "x": 3440,
      "y": 3480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Движение со связями",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 21,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "У стенки"
        },
        {
          "name": "Треугольная пластинка"
        },
        {
          "name": "А где палка?"
        },
        {
          "name": "У покосившейся стенки"
        },
        {
          "name": "Флажок"
        }
      ],
      "text": "Проекция на связь, материальные точки, жёсткий стержень, скорости, смещение, единичный вектор, проекции скоростей, тангенциальные компоненты, поступательное движение"
    },
    "position": {
      "x": 4420,
      "y": 4780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Равноускоренное движение",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 22,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 9-11"
      ],
      "problems": [
        {
          "name": "Фонтан"
        },
        {
          "name": "Третья секунда"
        },
        {
          "name": "Навстречу"
        },
        {
          "name": "Между опорами"
        },
        {
          "name": "Минимальный путь"
        }
      ],
      "text": "Ускорение, равноускоренное движение, изменение скорости, промежуток времени, мгновенное ускорение, перемещение, график зависимости скорости, площадь трапеции, радиус-вектор"
    },
    "position": {
      "x": 5160,
      "y": 4040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Конус Маха",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 23,
      "problems": [
        {
          "name": "Движение в воде"
        },
        {
          "name": "Истребитель"
        },
        {
          "name": "Внутри конуса Маха"
        }
      ],
      "text": "Скорость звука, упругая среда, механические возмущения, плотность, упругость, число Маха, скорость потока, локальная скорость звука, волновая сфера, геометрическая огибающая"
    },
    "position": {
      "x": 4460,
      "y": 4040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Упругие столкновения с тяжёлой стенкой",
    "data": {
      "section": "механика",
      "grade": "9",
      "text": "Упругие удары шарика о неподвижную и движущуюся стенку, разложение скорости на нормальную и касательную компоненты",
      "number": 24,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 9-11"
      ],
      "problems": [
        {
          "name": "Стенка"
        },
        {
          "name": "Под углом"
        },
        {
          "name": "Рикошетное столкновение"
        }
      ]
    },
    "position": {
      "x": 5860,
      "y": 4040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод виртуальных перемещений",
    "data": {
      "section": "механика",
      "grade": "8",
      "number": 25,
      "olympiads": [
        "МОШ, 8-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Цепочка "
        },
        {
          "name": "Верёвка"
        },
        {
          "name": "Конус"
        },
        {
          "name": "Сложная система"
        }
      ],
      "text": "Виртуальное приращение, равновесие, виртуальная работа, принцип виртуальных работ, условие равновесия, статическое равновесие, примеры, нить, блок, грузы, масса, сила натяжения"
    },
    "position": {
      "x": 3100,
      "y": 3820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Бернулли",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 26,
      "problems": [
        {
          "name": "Изгиб"
        },
        {
          "name": "Бочка"
        },
        {
          "name": "Вытекание жидкости"
        }
      ],
      "text": "Условие сохранения массы, стазис, несжимаемая жидкость, объёмный расход, уравнение Бернулли, давление, высота, скорость, работа, потенциальная энергия, кинетическая энергия"
    },
    "position": {
      "x": 3740,
      "y": 4040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Устойчивость равновесия",
    "data": {
      "section": "механика",
      "grade": "10",
      "number": 27,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Улёт заряда"
        },
        {
          "name": "Жидкая деревяшка"
        }
      ],
      "text": "равновесие, точка равновесия, результирующая сила, потенциальная энергия, энергетический критерий, устойчивость, ряд Тейлора, локальный минимум, напряжение, силовой критерий"
    },
    "position": {
      "x": 3420,
      "y": 7980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Мгновенный центр вращения",
    "data": {
      "section": "механика",
      "grade": "9",
      "text": "Мгновенный центр вращения (МЦВ), определение угловой скорости через МЦВ, построение скоростей точек тела, частные случаи",
      "number": 28,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11"
      ],
      "problems": [
        {
          "name": "Опять треугольная пластинка"
        },
        {
          "name": "Ступка с пестиком"
        },
        {
          "name": "Абсолютно твёрдое тело"
        }
      ]
    },
    "position": {
      "x": 4420,
      "y": 5040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема Кёнига",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 29,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Санки"
        }
      ],
      "text": "Теорема Кёнига, кинетическая энергия, система материальных точек, скорость центра масс, масса, скорость, смещение, энергия поступательного движения"
    },
    "position": {
      "x": 3860,
      "y": 6060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Движение твёрдого тела, 9 класс",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 30,
      "problems": [
        {
          "name": "Геометрия в физике"
        },
        {
          "name": "Связанные точки"
        },
        {
          "name": "Система с блоками"
        },
        {
          "name": "Клины"
        },
        {
          "name": "Вагонетка"
        }
      ]
    },
    "position": {
      "x": 3860,
      "y": 6820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Динамика. Второй закон Ньютона.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 31,
      "text": "Законы Ньютона (1-й, 2-й, 3-й), пример с наклонной плоскостью и трением, центр масс системы частиц, теорема о движении центра масс.",
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 7-11"
      ],
      "problems": [
        {
          "name": "Связанные нитью"
        },
        {
          "name": "Центр масс"
        },
        {
          "name": "Сила под углом"
        },
        {
          "name": "Три груза"
        },
        {
          "name": "Кубик на доске"
        },
        {
          "name": "Перемещение"
        },
        {
          "name": "Платформа с выступом"
        }
      ]
    },
    "position": {
      "x": 4920,
      "y": 5300
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Равномерное движение по окружности",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 32,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Опять треугольная пластинка"
        },
        {
          "name": "Ступка с пестиком"
        },
        {
          "name": "Абсолютно твёрдое тело"
        }
      ],
      "text": "Радиан, единица угла, длина дуги, радиус, центральный угол, полный оборот, перевод углов, малые углы, приближения, равномерное движение, скорость, угловая скорость"
    },
    "position": {
      "x": 4920,
      "y": 4520
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Баллистика. Координатный метод.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 33,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "В четыре раза"
        },
        {
          "name": "С высоты"
        },
        {
          "name": "Угол к горизонту"
        },
        {
          "name": "Пушка на склоне горы"
        },
        {
          "name": "Винтовка"
        },
        {
          "name": "Кузнечик"
        }
      ],
      "text": "Баллистика, механика, движение тел, начальная скорость, координатный метод, горизонтальная составляющая, вертикальная составляющая, ускорение свободного падения"
    },
    "position": {
      "x": 5400,
      "y": 4520
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Баллистика. Векторный метод.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 34,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Камень"
        },
        {
          "name": "Озорные мышата"
        },
        {
          "name": "Осада Леопольда"
        }
      ],
      "text": "Векторный метод, баллистика, векторное уравнение, начальная скорость, ускорение свободного падения, скорость, перемещение, векторная сумма, треугольник скоростей, медиана"
    },
    "position": {
      "x": 5400,
      "y": 4780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Баллистика, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 35,
      "problems": [
        {
          "name": "Фейерверк"
        },
        {
          "name": "Минимальное время"
        },
        {
          "name": "Петарда"
        },
        {
          "name": "Арка"
        },
        {
          "name": "Кузнец молодец"
        }
      ]
    },
    "position": {
      "x": 5400,
      "y": 5040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Центростремительное ускорение",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 36,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Поворот вектора"
        }
      ],
      "text": "равномерное движение, ускорение, изменение вектора скорости, центростремительное ускорение, треугольник перемещений, радиус-вектора, хорда, треугольник скоростей"
    },
    "position": {
      "x": 4920,
      "y": 4780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неравномерное движение по окружности",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 37,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Полное ускорение"
        },
        {
          "name": "Радиус кривизны"
        }
      ],
      "text": "Тангенциальное ускорение, нормальное ускорение, неравномерное движение, окружность, скорость, модуль скорости, угловое ускорение, угол поворота, изменение угловой скорости"
    },
    "position": {
      "x": 4920,
      "y": 5040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Кинематика, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 111,
      "problems": [
        {
          "name": "Максимальная средняя"
        },
        {
          "name": "Максимальная абсолютная"
        },
        {
          "name": "Изменяющееся ускорение"
        },
        {
          "name": "Круговая погоня"
        },
        {
          "name": "Сильный ветер"
        }
      ]
    },
    "position": {
      "x": 4920,
      "y": 5170
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Всемирное тяготение. Космические скорости.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 38,
      "olympiads": [
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Движение Луны"
        },
        {
          "name": "Тёмная материя"
        },
        {
          "name": "Двойная звезда"
        }
      ],
      "text": "Закон всемирного тяготения, гравитационная постоянная, потенциальная энергия, работа силы тяжести, теорема о ненапряжении, однородная сфера, гравитационное поле, полость"
    },
    "position": {
      "x": 4920,
      "y": 6060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неинерциальные системы отсчёта",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 39,
      "olympiads": [
        "Физтех, 10-11"
      ],
      "problems": [
        {
          "name": "Весы в лифте"
        },
        {
          "name": "Груз на пружине"
        },
        {
          "name": "Странные весы"
        },
        {
          "name": "Две шайбы"
        }
      ]
    },
    "position": {
      "x": 5200,
      "y": 6200
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Вращательные НеИСО",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 40,
      "olympiads": [
        "Физтех, 10-11"
      ],
      "problems": [
        {
          "name": "Шарик на нити"
        },
        {
          "name": "Вращение массивной веревки"
        },
        {
          "name": "Конический сосуд"
        },
        {
          "name": "По спирали"
        },
        {
          "name": "Вращающийся сосуд"
        }
      ],
      "text": "Движение, вращательная система отсчёта, материальная точка, скорость, угловая скорость, линейная скорость, ускорение, силы инерции, сила Кориолиса, осестремительная сила"
    },
    "position": {
      "x": 5200,
      "y": 6540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сухое трение",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 41,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 9-11"
      ],
      "problems": [
        {
          "name": "Ускорение нити"
        },
        {
          "name": "Нить под углом"
        },
        {
          "name": "Хула-хуп"
        }
      ],
      "text": "Сила трения, касательная сила, микронеровности, нормальная реакция, коэффициент трения покоя, максимальная сила трения, коэффициент трения скольжения, явление застоя"
    },
    "position": {
      "x": 4640,
      "y": 6200
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Импульс",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 42,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Отскок"
        },
        {
          "name": "Нержиданный поворот"
        },
        {
          "name": "Соединённые резинкой"
        }
      ],
      "text": "Импульс тела, масса, скорость, вектор, аддитивность, импульс системы, импульс силы, изменение импульса, внешняя сила, закон изменения импульса, интеграл, материальная точка"
    },
    "position": {
      "x": 5520,
      "y": 6060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Реактивная сила",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 43,
      "problems": [
        {
          "name": "Расход топлива"
        },
        {
          "name": "Максимум кинетической энергии"
        }
      ],
      "text": "Реактивная сила, масса, скорость, закон сохранения импульса, уравнение Циолковского, массовый расход, интеграл, приращение скорости, экспонента, ракета, выброшенная масса"
    },
    "position": {
      "x": 5520,
      "y": 6380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Вязкое трение",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 44,
      "problems": [
        {
          "name": "Карлсон"
        },
        {
          "name": "Вязкий валик"
        },
        {
          "name": "Валик на диске"
        }
      ],
      "text": "Вязкое трение, внутреннее трение, сила вязкого сопротивления, скорость, режим обтекания, ламинарный режим, турбулентный режим, число Рейнольдса, плотность, динамическая вязкость"
    },
    "position": {
      "x": 4380,
      "y": 6820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Столкновения",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 45,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Перпендикулярно"
        },
        {
          "name": "Нагрев"
        },
        {
          "name": "Нецентральный удар"
        },
        {
          "name": "Цепочка"
        }
      ],
      "text": "Столкновения, внутренние силы, закон сохранения импульса, закон сохранения кинетической энергии, абсолютно упругий удар, суммарный импульс, суммарная кинетическая энергия"
    },
    "position": {
      "x": 6040,
      "y": 6380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Законы сохранения, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 46,
      "problems": [
        {
          "name": "Доски и шарики"
        },
        {
          "name": "Горка и шайба"
        },
        {
          "name": "Точное столкновение"
        },
        {
          "name": "Шарик и груз"
        },
        {
          "name": "Ускорение подставки"
        }
      ]
    },
    "position": {
      "x": 5780,
      "y": 6820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Динамика, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9",
      "number": 47,
      "problems": [
        {
          "name": "Звёзды на прямой"
        },
        {
          "name": "Водные лыжи"
        },
        {
          "name": "Катушка ниток"
        },
        {
          "name": "Шероховатая область"
        },
        {
          "name": "Вращающийся сосуд со стержнем"
        }
      ]
    },
    "position": {
      "x": 4920,
      "y": 6820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Момент импульса",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 48,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11",
        "Физтех, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 5760,
      "y": 10180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Момент инерции",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 49,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 5520,
      "y": 10420
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Гравитация. Законы Кеплера.",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 50,
      "olympiads": [
        "МОШ, 11",
        "Ломоносов, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 5760,
      "y": 10640
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Механика, 11 класс.",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 51,
      "problems": []
    },
    "position": {
      "x": 5520,
      "y": 10880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Гармонические колебания",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 52,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 9140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия в гармонических колебаниях",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 53,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 9340
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Затухающие колебания",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 54,
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 9540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Резонанс",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 55,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 9740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сложение колебаний. Биения.",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 56,
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 9940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Колебания, 11 класс",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 57,
      "problems": []
    },
    "position": {
      "x": 4020,
      "y": 10880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Механические волны",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 58,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 2960,
      "y": 10260
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Постулаты специальной теории относительности",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 59,
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 10480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Эффект Доплера",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 60,
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 2960,
      "y": 10880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Парадоксы и эффекты",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 61,
      "olympiads": [],
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 10680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Релятивистская динамика",
    "data": {
      "section": "механика",
      "grade": "11",
      "number": 62,
      "olympiads": [],
      "problems": []
    },
    "position": {
      "x": 3420,
      "y": 10880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тригонометрия",
    "data": {
      "section": "математика",
      "grade": "8",
      "number": 63,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 9-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Тангенс через синус"
        },
        {
          "name": "Большой угол"
        }
      ],
      "text": "косинус, тангенс, синус, площадь треугольника, высота, тригонометрические функции, формулы суммы углов, формулы разности углов, двойные углы, половинные углы"
    },
    "position": {
      "x": 8280,
      "y": 3480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Свойства тригонометрических функций",
    "data": {
      "section": "математика",
      "grade": "9",
      "text": "Базовые тригонометрические тождества: связи между синусом/косинусом/тангенсом/котангенсом, формулы суммы и разности углов, двойных и половинных углов, теоремы синусов и косинусов, формулы площади треугольника.",
      "number": 64,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 9-11",
        "Курчатов, 9-11",
        "Физтех, 9-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Угол треугольника"
        },
        {
          "name": "Упрощение"
        }
      ]
    },
    "position": {
      "x": 8280,
      "y": 4700
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Векторы",
    "data": {
      "section": "математика",
      "grade": "9",
      "number": 65,
      "olympiads": [
        "МОШ, 7-11",
        "Росатом, 7-11",
        "Курчатов, 7-11",
        "Физтех, 7-11",
        "Ломоносов, 7-9, 10-11"
      ],
      "problems": [
        {
          "name": "Модуль суммы"
        },
        {
          "name": "Угол между векторами"
        },
        {
          "name": "Произведение"
        }
      ],
      "text": "Векторы, направленный отрезок, величина, модуль, направление, скалярные величины, векторные величины, проекции вектора, координатная форма, сложение векторов, правило треугольника"
    },
    "position": {
      "x": 8280,
      "y": 4060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифференцирование",
    "data": {
      "section": "математика",
      "grade": "9",
      "number": 66,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 9-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Многочлен"
        },
        {
          "name": "Частное"
        },
        {
          "name": "Сложная функция"
        },
        {
          "name": "Произведение"
        },
        {
          "name": "Максимум"
        }
      ],
      "text": "Предел, производная, график, физический смысл, скорость, мощность, дифференциалы, приращение функции, линейная часть, независимая величина, правила дифференцирования"
    },
    "position": {
      "x": 8280,
      "y": 5360
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интегрирование",
    "data": {
      "section": "математика",
      "grade": "9",
      "number": 67,
      "olympiads": [
        "МОШ, 10-11",
        "Курчатов, 10-11",
        "Физтех, 11"
      ],
      "problems": [
        {
          "name": "Многочлен"
        },
        {
          "name": "Произведение"
        },
        {
          "name": "Частное"
        },
        {
          "name": "Тригонометрия"
        },
        {
          "name": "Логарифм"
        }
      ],
      "text": "Первообразная, неопределённый интеграл, определённый интеграл, прирост первообразной, площадь под кривой, свойства интегралов, основные интегралы, экспонента, натуральный логарифм"
    },
    "position": {
      "x": 8280,
      "y": 6040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа с малыми величинами",
    "data": {
      "section": "математика",
      "grade": "10",
      "text" : "Базовые тригонометрические тождества: связи между синусом/косинусом/тангенсом/котангенсом, формулы суммы и разности углов, двойных и половинных углов, теоремы синусов и косинусов, формулы площади треугольника.",
      "number": 68,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11"
      ],
      "problems": [
        {
          "name": "Погрешность"
        },
        {
          "name": "Ряд деления"
        },
        {
          "name": "Корень из ряда"
        }
      ]
    },
    "position": {
      "x": 8280,
      "y": 6700
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Логарифмы, показательные функции",
    "data": {
      "section": "математика",
      "grade": "10",
      "number": 69,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Логарифмические махинации"
        },
        {
          "name": "Экспоненциальная производная"
        }
      ],
      "text": "логарифм, свойства логарифма, производная, показательная функция, число Эйлера, натуральный логарифм, производные логарифмов, производные показательных функций, степенные функции"
    },
    "position": {
      "x": 8280,
      "y": 7980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Телесный угол",
    "data": {
      "section": "математика",
      "grade": "10",
      "number": 70,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 11"
      ],
      "problems": [
        {
          "name": "Грани"
        },
        {
          "name": "Цилиндры"
        }
      ],
      "text": "телесный угол, стеррадиан, площадь, сфера, полусфера, аддитивность, сферические координаты, полярный угол, азимут, элемент телесного угла, конус, сферическая шапка"
    },
    "position": {
      "x": 8280,
      "y": 7340
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Векторное произведение",
    "data": {
      "section": "математика",
      "grade": "11",
      "number": 71,
      "olympiads": [
        "МОШ, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 8280,
      "y": 8660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифференциальные уравнения. Уравнения колебаний.",
    "data": {
      "section": "математика",
      "grade": "11",
      "number": 72,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 8280,
      "y": 9380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Ряды",
    "data": {
      "section": "математика",
      "grade": "11",
      "number": 73,
      "problems": []
    },
    "position": {
      "x": 8280,
      "y": 10140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Комплексные числа",
    "data": {
      "section": "математика",
      "grade": "11",
      "number": 74,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 8280,
      "y": 10880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Отражение света. Зеркала.",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 75,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 10-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "На складе"
        },
        {
          "name": "Вращающееся зеркало"
        },
        {
          "name": "Муравей и зеркало"
        }
      ],
      "text": "Закон отражения, плоское зеркало, угол падения, угол отражения, нормаль, изображение источника, симметрия, протяжённый источник, зона видимости, зеркальный источник"
    },
    "position": {
      "x": 9620,
      "y": 1360
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Преломление света. Закон Снеллиуса.",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 76,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Призма на воде"
        },
        {
          "name": "Преломление на шаре"
        },
        {
          "name": "Прозрачный слой"
        },
        {
          "name": "Толстая линза"
        }
      ],
      "text": "Принцип Ферма, оптическая длина пути, показатель преломления, закон преломления света, закон Снеллиуса, углы преломления, базовые значения показателя преломления, воздух, вода"
    },
    "position": {
      "x": 9620,
      "y": 2260
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Пластины, призмы",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 77,
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Смещение в пластине"
        },
        {
          "name": "Двойная призма"
        },
        {
          "name": "Микропризма"
        }
      ],
      "text": "Плоско-параллельная пластина, угол падения, угол преломления, толщина пластины, геометрия параллельных прямых, оптический клин, угол вершины, углы преломления, выходной угол"
    },
    "position": {
      "x": 9620,
      "y": 3140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Полное внутреннее отражение",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 78,
      "text": "Закон преломления, полное внутреннее отражение, критический угол, примеры (алмаз, вода–воздух).",
      "olympiads": [
        "МОШ, 9-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Клин и глицерин"
        },
        {
          "name": "Оптическая планета"
        },
        {
          "name": "Оптическая вращалка"
        }
      ]
    },
    "position": {
      "x": 9620,
      "y": 3960
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Линза, построение изображений",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 79,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Поиск луча"
        },
        {
          "name": "Поиск линзы"
        },
        {
          "name": "Изображение без линзы"
        },
        {
          "name": "Четыре звезды"
        }
      ],
      "text": "тонкие линзы, свойства, собирающая линза, рассеивающая линза, главная оптическая ось, оптический центр, фокус, фокальная плоскость, фокальное расстояние, обратимость лучей"
    },
    "position": {
      "x": 9620,
      "y": 4780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Формула тонкой линзы",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 80,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Совпадающие изображения"
        },
        {
          "name": "Три точки"
        },
        {
          "name": "Две перестановки"
        }
      ],
      "text": "Постановка задачи, собирающая линза, фокусное расстояние, предмет, высота, расстояние, изображение, лучи, оптический центр, пересечение, вершина изображения, вывод формулы"
    },
    "position": {
      "x": 9620,
      "y": 5600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Увеличение",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 81,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": [
        {
          "name": "На экране"
        },
        {
          "name": "Увеличение среднего"
        },
        {
          "name": "Таракашка"
        }
      ],
      "text": "Поперечное увеличение, высота предмета, расстояние, изображение, главный луч, подобие треугольников, формула тонкой линзы, осевые смещения, дифференцирование"
    },
    "position": {
      "x": 9620,
      "y": 6400
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Оптические системы",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 82,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": [
        {
          "name": "Система сил"
        }
      ],
      "text": "Задача двух тонких линз, фокусы линз, расстояние между линзами, изображение первой линзы, расстояние до предмета второй линзы, положение итогового изображения"
    },
    "position": {
      "x": 9620,
      "y": 7200
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Оптика, 10 класс.",
    "data": {
      "section": "оптика",
      "grade": "10",
      "number": 83,
      "problems": [
        {
          "name": "Прозрачный шар"
        },
        {
          "name": "Чертеж в шкафу"
        },
        {
          "name": "Взгляд из торца"
        },
        {
          "name": "Сферическая среда"
        },
        {
          "name": "Микроавтомобиль"
        }
      ]
    },
    "position": {
      "x": 9620,
      "y": 7980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дисперсия",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 84,
      "text": "",
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 13660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интерференция света. Когерентные источники.",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 85,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Физтех, 11",
        "Курчатов, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 13860
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интерференция света. Временная когерентность.",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 86,
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 14060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифракция Фраунгофера",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 87,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 14260
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифракция Френеля",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 88,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 14460
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифракционная решётка",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 89,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 14860
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Поляризация света",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 90,
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 14660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Волновая оптика, 11 класс",
    "data": {
      "section": "оптика",
      "grade": "11",
      "number": 91,
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 15060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Напряжённость электрического поля, потенциал",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 92,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Разность потенциалов"
        },
        {
          "name": "Левитирующий заряд"
        }
      ],
      "text": "Напряжённость электрического поля, пробный заряд, сила, отношение, потенциал электрического поля, потенциальная энергия, разность потенциалов, работа поля"
    },
    "position": {
      "x": 6760,
      "y": 900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила тока, напряжение. Закон Ома.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 93,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Сравнение токов"
        },
        {
          "name": "Сравнение напряжений"
        },
        {
          "name": "Два резистора"
        },
        {
          "name": "Увеличение резистора"
        }
      ],
      "text": "Электрический ток, Проводник, Сила тока, Закон сохранения заряда, Напряжение, Работа, Потенциал, Резистор, Сопротивление, Закон Ома, Удельное сопротивление, Длина проводника"
    },
    "position": {
      "x": 6760,
      "y": 1240
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Мощность электрического тока",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 94,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Элементарный элемент"
        },
        {
          "name": "Простая цепь"
        },
        {
          "name": "Проволока"
        }
      ],
      "text": "Принцип выделения электроэнергии, электрический ток, проводник, внутренняя энергия, тепло, электроны, электрическое поле, атомы, кристаллическая решётка, кинетическая энергия"
    },
    "position": {
      "x": 7760,
      "y": 2980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электричество, 8 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 95,
      "problems": [
        {
          "name": "Резисторы из вещества"
        },
        {
          "name": "Эквивалентность"
        },
        {
          "name": "Трёхмерная цепь"
        },
        {
          "name": "Приборная цепь"
        },
        {
          "name": "Мощность на резисторах"
        }
      ]
    },
    "position": {
      "x": 6760,
      "y": 3820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Параллельное и последовательное соединения резисторов",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 96,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Первая цепочка"
        },
        {
          "name": "Вторая цепочка"
        }
      ],
      "text": "Системы резисторов, резисторы, эквивалентное сопротивление, закон Ома, последовательное соединение, общее напряжение, общий ток, параллельное соединение, напряжение на резисторах"
    },
    "position": {
      "x": 6760,
      "y": 1580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Правила Кирхгофа",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 97,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Перемычка"
        },
        {
          "name": "Два источника"
        },
        {
          "name": "Три источника"
        },
        {
          "name": "Нетривиальное соединение"
        }
      ],
      "text": "Первый закон Кирхгофа, узлы, токи, алгебраическая сумма, сохранение заряда, Второй закон Кирхгофа, закон контуров, напряжения, замкнутый контур, падение напряжения"
    },
    "position": {
      "x": 6640,
      "y": 2120
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Симметричные цепи",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 98,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Треугольник"
        },
        {
          "name": "Пятиугольник"
        },
        {
          "name": "Кубик "
        },
        {
          "name": "Призма"
        }
      ],
      "text": "Постановка задачи, система уравнений Кирхгофа, симметрия, хорошая симметрия, эквивалентное сопротивление, токи, напряжения, плохая симметрия, разность потенциалов"
    },
    "position": {
      "x": 6880,
      "y": 2460
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод наложения токов",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 99,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Похожий пример"
        },
        {
          "name": "Треугольная сетка"
        }
      ],
      "text": "Процесс наложения цепей, резисторы, выводы, симметрия, закон Кирхгофа, токи, эквивалентное сопротивление, бесконечные сети, квадратная цепь, потенциал, наложение цепей"
    },
    "position": {
      "x": 7200,
      "y": 2820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Бесконечные цепи",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 100,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Общий случай"
        },
        {
          "name": "Удвоение"
        }
      ],
      "text": "бесконечная цепь, эквивалентное сопротивление, саморазрешающееся уравнение, параллельное соединение, квадратное уравнение, корни, рекуррентное уравнение, ячейка, сопротивление"
    },
    "position": {
      "x": 7200,
      "y": 3140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Источники тока",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 101,
      "olympiads": [
        "МОШ, 8-11",
        "Физтех, 9-11"
      ],
      "problems": [
        {
          "name": "Источная цепь"
        }
      ],
      "text": "Источники ЭДС, электродвижущая сила, внутреннее сопротивление, напряжение, ток, ток короткого замыкания, вольт–амперная характеристика, закон Кирхгофа, терминальное напряжение"
    },
    "position": {
      "x": 6400,
      "y": 2460
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод эквивалентного источника",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 102,
      "olympiads": [
        "МОШ, 8-10",
        "Росатом, 8-9",
        "Курчатов, 8-9",
        "Физтех, 9",
        "Ломоносов, 8-10"
      ],
      "problems": [
        {
          "name": "Пример соединения"
        },
        {
          "name": "Без источника"
        },
        {
          "name": "То же самое"
        },
        {
          "name": "Ошибочное подключение"
        }
      ],
      "text": "Системы источников, эквивалентный источник, ЭДС, внутреннее сопротивление, разомкнутая нагрузка, открытая ЭДС, эквивалентное сопротивление, вольт-амперная характеристика"
    },
    "position": {
      "x": 6760,
      "y": 2980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Измерительные приборы",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 103,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Амперметры"
        },
        {
          "name": "Вольтметры"
        },
        {
          "name": "Омметры"
        }
      ],
      "text": "Амперметр, вольтметр, омметр, измерение тока, измерение напряжения, измерение сопротивления, внутреннее сопротивление, подключение, последовательное подключение"
    },
    "position": {
      "x": 6100,
      "y": 2820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Вольтамперная характеристика",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 104,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Неизвестный элемент"
        },
        {
          "name": "Ещё один"
        },
        {
          "name": "Нагрузочная прямая"
        },
        {
          "name": "Диод в цепи"
        }
      ],
      "text": "ВАХ, график, сила тока, напряжение, последовательное соединение, общее напряжение, ток, параллельное соединение, нагрузочная прямая, внешняя цепь, источник ЭДС"
    },
    "position": {
      "x": 5860,
      "y": 3280
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Мостовые схемы",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 105,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Найти мост"
        },
        {
          "name": "Приборный мост"
        },
        {
          "name": "Продолжение"
        }
      ],
      "text": "мостовая схема, сопротивления, токи, законы Кирхгофа, уравнения, баланс моста, эквивалентное сопротивление, токораспределение, последовательные плеча, параллельное соединение"
    },
    "position": {
      "x": 6420,
      "y": 3140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Преобразование звезда-треугольник",
    "data": {
      "section": "электромагнетизм",
      "grade": "8",
      "number": 106,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Равные резисторы"
        },
        {
          "name": "Нетривиальное применение"
        }
      ],
      "text": "Эквивалентные цепи, трёхвыводная сеть, узлы, звезда, треугольник, сопротивления, эквивалентное сопротивление, пути, формулы преобразования, система уравнений, переход"
    },
    "position": {
      "x": 6420,
      "y": 3400
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Поток электрического поля. Теорема Гаусса.",
    "data": {
      "section": "электромагнетизм",
      "grade": "10",
      "text": "Телесный угол, поток электрического поля, применение к полупространству, теорема Гаусса, вклад внешних зарядов в поток (нулевой).",
      "number": 107,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Расчёт полей"
        },
        {
          "name": "Выталкивание грани"
        },
        {
          "name": "Радиальное поле"
        },
        {
          "name": "Поле отрезка"
        }
      ]
    },
    "position": {
      "x": 6760,
      "y": 4440
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема о единственности. Проводники в электростатическом поле.",
    "data": {
      "section": "электромагнетизм",
      "grade": "10",
      "number": 110,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Шар в однородном поле"
        },
        {
          "name": "Незаряженный шар"
        },
        {
          "name": "Сферический проводник"
        },
        {
          "name": "Притягивающиеся половинки"
        }
      ],
      "text": "Теорема о единственности, электростатика, распределение зарядов, потенциал, вектор напряжённости, разность зарядов, разностное поле, теорема Гаусса, поток поля"
    },
    "position": {
      "x": 6760,
      "y": 5180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод электростатических изображений",
    "data": {
      "section": "электромагнетизм",
      "grade": "10",
      "number": 112,
      "text": "Метод изображений, точечный заряд, проводящая плоскость, потенциал, напряжённость, распределение зарядов на проводнике, сила, работа, энергия системы зарядов.",
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11"
      ],
      "problems": [
        {
          "name": "Изображение стержня"
        },
        {
          "name": "Прямой уголок"
        }
      ]
    },
    "position": {
      "x": 6760,
      "y": 5900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия систем зарядов",
    "data": {
      "section": "электромагнетизм",
      "grade": "10",
      "number": 113,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Полусфера"
        },
        {
          "name": "Кубик"
        },
        {
          "name": "Конус"
        },
        {
          "name": "Металлическая сфера"
        }
      ],
      "text": "Энергия взаимодействия, система зарядов, работа, потенциал, заряд, проводящая пластина, метод изображений, энергия взаимодействия, работа переноса, изменение потенциальной энергии"
    },
    "position": {
      "x": 6760,
      "y": 6620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Диэлектрики в электростатическом поле",
    "data": {
      "section": "электромагнетизм",
      "grade": "10",
      "number": 114,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Энергия в веществе"
        },
        {
          "name": "Сила в конденсаторе"
        }
      ],
      "text": "Поляризация, диэлектрическая проницаемость, связанные заряды, электрическое поле, линейные материалы, граничное условие, свободные заряды, однородный диэлектрик"
    },
    "position": {
      "x": 6760,
      "y": 7320
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электростатика, 10 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "10",
      "number": 115,
      "problems": [
        {
          "name": "Полусферы"
        },
        {
          "name": "Электрический стержень"
        },
        {
          "name": "Мудрый проводник"
        },
        {
          "name": "Микропроводник"
        },
        {
          "name": "Изображение маятника"
        }
      ]
    },
    "position": {
      "x": 6760,
      "y": 7980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Конденсаторы",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 116,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 8660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Соединение конденсаторов. Энергия конденсатора.",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 117,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 8880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Объёмная плотность энергии электрического поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 118,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 9100
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "RC-цепи",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 119,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 9320
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Ток в различных средах",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 120,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 9520
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электростатика, 11 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 121,
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 9740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Магнитное поле. Сила Лоренца.",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 122,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 9960
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила Ампера. Момент силы Ампера.",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 123,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 10180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Закон Био-Савара-Лапласа",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 124,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 10400
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема Гаусса для магнитного поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 125,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 10620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема о циркуляции магнитного поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 126,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11",
        "Физтех, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 10840
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Закон электромагнитной индукции Фарадея",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 127,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 11060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Движущийся проводник в магнитном поле",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 128,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 11280
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Магнитная гидродинамика",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 129,
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 11500
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Эффект Холла",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 130,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 11720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Самоиндукция",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 131,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 11940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия магнитного поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 132,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 12160
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электромагнетизм, 11 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 133,
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 12380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Электромагнитные волны",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 134,
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7260,
      "y": 12940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интерференция и дифракция ЭМ волн",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 135,
      "olympiads": [
        "МОШ, 11",
        "Росатом, 11",
        "Курчатов, 11",
        "Физтех, 11",
        "Ломоносов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7260,
      "y": 13140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дисперсия",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 136,
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7840,
      "y": 13660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Импульс и энергия фотонов",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 137,
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7260,
      "y": 13660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Фотоэффект",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 138,
      "olympiads": [
        "МОШ, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 7260,
      "y": 13860
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Корпускулярно-волновой дуализм",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 139,
      "olympiads": [],
      "problems": []
    },
    "position": {
      "x": 7260,
      "y": 14060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Соотношение неопределённостей Гейзенберга",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 140,
      "problems": []
    },
    "position": {
      "x": 7260,
      "y": 14260
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Переменный ток. Импеданс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 141,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 12740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Резонанс. Мощность переменного тока",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 142,
      "olympiads": [
        "МОШ, 11",
        "Курчатов, 11"
      ],
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 12940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Переменный ток, 11 класc",
    "data": {
      "section": "электромагнетизм",
      "grade": "11",
      "number": 143,
      "problems": []
    },
    "position": {
      "x": 6760,
      "y": 13140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тепловое расширение",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 144,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Две линейки"
        },
        {
          "name": "Объёмное расширение"
        },
        {
          "name": "Дуга"
        }
      ],
      "text": "Линейное расширение, объёмное расширение, температура, коэффициент линейного расширения, коэффициент объёмного расширения, приращение длины, приращение объёма, связь коэффициентов"
    },
    "position": {
      "x": 10480,
      "y": 2160
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Количество теплоты, внутренняя энергия",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 145,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Изменения величин "
        },
        {
          "name": "Теплота на превращение"
        },
        {
          "name": "Разное сгорание"
        }
      ],
      "text": "Внутренняя энергия, Теплопередача, Количество теплоты, Удельная теплоёмкость, Нагревание, Охлаждение, Теплоёмкость, Фазовые переходы, Агрегатные состояния, Плавление"
    },
    "position": {
      "x": 11040,
      "y": 1360
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Влажность",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 146,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Относительная влажность"
        },
        {
          "name": "Табличные данные"
        }
      ],
      "text": "Абсолютная влажность, Давление пара, Насыщенный пар, Давление насыщенного пара, Относительная влажность, Критерий кипения, Испарение, Температура кипения, Атмосферное давление"
    },
    "position": {
      "x": 11040,
      "y": 2380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Уравнение теплового баланса",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 147,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Два тела"
        },
        {
          "name": "Медная пластина"
        },
        {
          "name": "Переливание"
        }
      ],
      "text": "Уравнение теплового баланса, замкнутая система, количество теплоты, нагрев, фазовые переходы, удельная теплоёмкость, масса тела, конечная температура, начальная температура"
    },
    "position": {
      "x": 11420,
      "y": 2040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Внешние источники теплоты. Теплопотери.",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 148,
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Ускорение кипения"
        },
        {
          "name": "Ускорение плавления"
        },
        {
          "name": "Теплопотери"
        }
      ],
      "text": "Мощность теплопотерь, тепловая задача, температура тела, температура окружающей среды, стационарный режим, потоки тепла, коэффициент теплопотерь, разность температур"
    },
    "position": {
      "x": 11420,
      "y": 2600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теплопроводность. Закон Ньютона-Рихмана.",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 149,
      "text": "Теплопроводность, закон Фурье для теплового потока, закон Ньютона–Рихмана для теплообмена с окружающей средой, примеры для стержня и для двухслойной стенки.",
      "olympiads": [
        "МОШ, 8-11",
        "Росатом, 8-11",
        "Курчатов, 8-11",
        "Физтех, 9-11",
        "Ломоносов, 8-11"
      ],
      "problems": [
        {
          "name": "Остывание кубов"
        },
        {
          "name": "Между слоями"
        }
      ]
    },
    "position": {
      "x": 11420,
      "y": 3160
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Термодинамика, 8 класс.",
    "data": {
      "section": "термодинамика",
      "grade": "8",
      "number": 150,
      "problems": [
        {
          "name": "Кипятильники"
        },
        {
          "name": "Комбинированная задача"
        },
        {
          "name": "Тонущая бутылка"
        },
        {
          "name": "Сублимация"
        },
        {
          "name": "Снег на фонаре"
        }
      ]
    },
    "position": {
      "x": 11040,
      "y": 3820
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Длина свободного пробега",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 151,
      "text": "Длина свободного пробега частиц газа, сечение столкновения, модель Клаузиуса, максвелловский газ, итоговые формулы для давления, внутренней энергии и температуры.",
      "problems": [
        {
          "name": "Чужой газ"
        }
      ]
    },
    "position": {
      "x": 11040,
      "y": 4140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Уравнение Клапейрона-Менделеева",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 152,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Простой процесс"
        },
        {
          "name": "Необычный график"
        },
        {
          "name": "Азот"
        }
      ],
      "text": "Внутренняя энергия, работа газа, число степеней свободы, кинетическая энергия, идеальный газ, изотермический процесс, молярные теплоёмкости, изохорный процесс, изобарный процесс"
    },
    "position": {
      "x": 11040,
      "y": 4460
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа, внутренняя энергия. Первое начало термодинамики.",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 153,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Манометр"
        },
        {
          "name": "Раздельный сосуд"
        },
        {
          "name": "Минимальная плотность"
        }
      ],
      "text": "Введение, давление идеального газа, микроскопическая картина, молекулы, упругое отражение, импульс молекулы, нормальная компонента, количество молекул, элемент площади"
    },
    "position": {
      "x": 11040,
      "y": 4780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Адиабатический процесс",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 154,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "По молю гелия"
        },
        {
          "name": "Малое изменение"
        },
        {
          "name": "Два гелия"
        }
      ],
      "text": "Адиабатический процесс, идеальный газ, внутренняя энергия, дифференциал, первое начало термодинамики, дифференциальная форма, инвариант, коэффициент Пуассона, интегрирование"
    },
    "position": {
      "x": 11040,
      "y": 5100
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Политропический процесс",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 155,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Степень объёма"
        },
        {
          "name": "Большая работа"
        }
      ],
      "text": "Политропический процесс, молярная теплоёмкость, первое начало термодинамики, идеальный газ, инварианты, уравнение состояния, показатель политропы, изобара, изотерма, изохора"
    },
    "position": {
      "x": 11040,
      "y": 5420
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Термодинамические циклы",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 156,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Оптимальный прямоугольник"
        },
        {
          "name": "Изоцикл"
        },
        {
          "name": "Соединённые циклы"
        },
        {
          "name": "Треугольный цикл"
        }
      ],
      "text": "Циклы, рабочее тело, газ, начальное состояние, работа, тепло, $pV$-диаграмма, площадь, КПД, идеальный газ, прямоугольный цикл, изохоры, изобары, молей, температуры"
    },
    "position": {
      "x": 11040,
      "y": 5740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Второе начало термодинамики. Цикл Карно.",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 157,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Теплопотери дома"
        },
        {
          "name": "Части работы"
        },
        {
          "name": "Граничный цикл"
        }
      ],
      "text": "Формулировки ВНТ, формулировка Кельвина, формулировка Клаузиуса, идеальный двигатель, работа, тепло, холодильник, резервуар, цикл Карно, адиабатические процессы"
    },
    "position": {
      "x": 11040,
      "y": 6060
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теоремы Карно",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 159,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Рабочий пар"
        }
      ],
      "text": "Формулировки теорем Карно, первая теорема Карно, вторая теорема Карно, КПД, тепловая машина, обратимый цикл, рабочее тело, идеальный газ, цикл Карно, адиабатические процессы"
    },
    "position": {
      "x": 11040,
      "y": 6380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неравенство Клаузиуса",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 160,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Минимальная работа"
        }
      ],
      "text": "Цикл, теплотой, резервуары, температуры, машины Карно, КПД, работа, система, неравенство, второй закон термодинамики, интегральный вид, круговой интеграл, квазистатический цикл"
    },
    "position": {
      "x": 10740,
      "y": 6880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энтропия",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 161,
      "olympiads": [
        "МОШ, 10-11"
      ],
      "problems": [
        {
          "name": "Энтропия процесса"
        },
        {
          "name": "КПД через энтропию"
        }
      ],
      "text": "энтропия, квазистатический процесс, изменение энтропии, аддитивность, ограничения энтропии, самопроизвольные процессы, идеальный газ, работа, цикл Карно, теплоёмкость"
    },
    "position": {
      "x": 10740,
      "y": 7480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Влажный воздух",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 162,
      "olympiads": [
        "МОШ, 10-11",
        "Росатом, 10-11",
        "Курчатов, 10-11",
        "Физтех, 10-11",
        "Ломоносов, 10-11"
      ],
      "problems": [
        {
          "name": "Начальная влажность"
        },
        {
          "name": "Пружина и влажность"
        },
        {
          "name": "Влажный воздух"
        }
      ],
      "text": "Влажный воздух, смесь сухого воздуха и водяного пара, насыщающее давление, конденсация, изотерма \\(p(V)\\), водяной пар, сверхнагретый пар, двухфазная область"
    },
    "position": {
      "x": 11340,
      "y": 6880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Уравнение Клапейрона-Клаузиуса",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 163,
      "problems": [
        {
          "name": "Критерий уменьшения"
        },
        {
          "name": "Критическая точка"
        },
        {
          "name": "Изменение кипения"
        }
      ],
      "text": "Уравнение Клапейрона-Клаузиуса, цикл Карно, испарение, удельная теплота, работа, давление, объемный скачок, молярные теплоты, изменение внутренней энергии, конденсация"
    },
    "position": {
      "x": 11340,
      "y": 7180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неидеальные газы",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 164,
      "olympiads": [
        "МОШ, 10-11"
      ],
      "problems": [
        {
          "name": "Клаузиус"
        },
        {
          "name": "Ван-дер-Ваальс"
        }
      ],
      "text": "уравнение состояния, идеальный газ, газ Ван-дер-Ваальса, молекулы, объем, межмолекулярное притяжение, уравнение Ван-дер-Ваальса, критическая точка, фазовое равновесие, изотерма"
    },
    "position": {
      "x": 11340,
      "y": 7480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Термодинамика, 10 класс.",
    "data": {
      "section": "термодинамика",
      "grade": "10",
      "number": 165,
      "problems": [
        {
          "name": "Временной процесс"
        },
        {
          "name": "Гиря на сосуде"
        },
        {
          "name": "Ромбик"
        },
        {
          "name": "Влажный воздух"
        },
        {
          "name": "График теплоёмкости"
        }
      ]
    },
    "position": {
      "x": 11040,
      "y": 7980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Поверхностное натяжение",
    "data": {
      "section": "термодинамика",
      "grade": "11",
      "number": 166,
      "olympiads": [
        "МОШ, 10-11"
      ],
      "problems": []
    },
    "position": {
      "x": 11040,
      "y": 9360
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Равновесное тепловое излучение",
    "data": {
      "section": "термодинамика",
      "grade": "11",
      "number": 167,
      "problems": []
    },
    "position": {
      "x": 11040,
      "y": 10880
    },
    "width": 320,
    "height": 300
  }
];
export const rawEdges = [
  {
    id: "e0",
    source: "TheSolution",
    target: "Равномерное прямолинейное движение",
  },
  {
    id: "e1",
    source: "TheSolution",
    target: "Плотность",
  },
  {
    id: "e2",
    source: "TheSolution",
    target: "Работа с графиками",
  },
  {
    id: "e3",
    source: "TheSolution",
    target: "Электрический заряд. Закон Кулона.",
  },
  {
    id: "e4",
    source: "TheSolution",
    target:
      "Температура. Связь температуры с кинетической энергией движения молекул.",
  },
  {
    id: "e5",
    source: "TheSolution",
    target: "Тень. Полутень.",
  },
  {
    id: "e6",
    source: "Равномерное прямолинейное движение",
    target: "Средняя скорость. Относительное движение.",
  },
  {
    id: "e7",
    source: "Средняя скорость. Относительное движение.",
    target: "Кинематические связи. Блоки.",
  },
  {
    id: "e8",
    source: "Кинематические связи. Блоки.",
    target: "Закон Гука. Системы пружин.",
  },
  {
    id: "e9",
    source: "Плотность",
    target: "Сила. Третий закон Ньютона.",
  },
  {
    id: "e10",
    source: "Сила. Третий закон Ньютона.",
    target: "Сила тяжести",
  },
  {
    id: "e11",
    source: "Сила тяжести",
    target: "Закон Гука. Системы пружин.",
  },
  {
    id: "e12",
    source: "Сила тяжести",
    target: "Давление. Сообщающиеся сосуды",
  },
  {
    id: "e13",
    source: "Закон Гука. Системы пружин.",
    target: "Моменты",
  },
  {
    id: "e14",
    source: "Моменты",
    target: "Работа. Мощность. КПД",
  },
  {
    id: "e15",
    source: "Моменты",
    target: "Системы блоков. Статика со связями.",
  },
  {
    id: "e16",
    source: "Давление. Сообщающиеся сосуды",
    target: "Сила Архимеда",
  },
  {
    id: "e17",
    source: "Работа. Мощность. КПД",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e18",
    source: "Системы блоков. Статика со связями.",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e19",
    source: "Сила Архимеда",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e20",
    source: "Тур. Механика, 7 класс.",
    target: "Энергия",
  },
  {
    id: "e21",
    source: "Равномерное движение по окружности",
    target: "Движение со связями",
  },
  {
    id: "e22",
    source: "Тур. Механика, 7 класс.",
    target: "Равноускоренное движение",
  },
  {
    id: "e23",
    source: "Тур. Механика, 7 класс.",
    target: "Конус Маха",
  },
  {
    id: "e24",
    source: "Тур. Механика, 7 класс.",
    target: "Упругие столкновения с тяжёлой стенкой",
  },
  {
    id: "e25",
    source: "Энергия",
    target: "Метод виртуальных перемещений",
  },
  {
    id: "e26",
    source: "Энергия",
    target: "Бернулли",
  },
  {
    id: "e27",
    source: "Энергия",
    target: "Устойчивость равновесия",
  },
  {
    id: "e28",
    source: "Энергия",
    target: "Теорема Кёнига",
  },
  {
    id: "e29",
    source: "Динамика. Второй закон Ньютона.",
    target: "Теорема Кёнига",
  },
  {
    id: "e30",
    source: "Движение со связями",
    target: "Мгновенный центр вращения",
  },
  {
    id: "e31",
    source: "Мгновенный центр вращения",
    target: "Теорема Кёнига",
  },
  {
    id: "e32",
    source: "Равноускоренное движение",
    target: "Равномерное движение по окружности",
  },
  {
    id: "e33",
    source: "Равноускоренное движение",
    target: "Баллистика. Координатный метод.",
  },
  {
    id: "e34",
    source: "Баллистика. Координатный метод.",
    target: "Баллистика. Векторный метод.",
  },
  {
    id: "e35",
    source: "Баллистика. Векторный метод.",
    target: "Тур. Баллистика, 9 класс.",
  },
  {
    id: "e36",
    source: "Равномерное движение по окружности",
    target: "Центростремительное ускорение",
  },
  {
    id: "e37",
    source: "Центростремительное ускорение",
    target: "Неравномерное движение по окружности",
  },
  {
    id: "e45",
    source: "Неравномерное движение по окружности",
    target: "Тур. Кинематика, 9 класс.",
  },
  {
    id: "e38",
    source: "Тур. Кинематика, 9 класс.",
    target: "Динамика. Второй закон Ньютона.",
  },
  {
    id: "e39",
    source: "Динамика. Второй закон Ньютона.",
    target: "Всемирное тяготение. Космические скорости.",
  },
  {
    id: "e40",
    source: "Динамика. Второй закон Ньютона.",
    target: "Неинерциальные системы отсчёта",
  },
  {
    id: "e41",
    source: "Динамика. Второй закон Ньютона.",
    target: "Сухое трение",
  },
  {
    id: "e42",
    source: "Динамика. Второй закон Ньютона.",
    target: "Импульс",
  },
  {
    id: "e43",
    source: "Неинерциальные системы отсчёта",
    target: "Вращательные НеИСО",
  },
  {
    id: "e44",
    source: "Сухое трение",
    target: "Вязкое трение",
  },
  {
    id: "e46",
    source: "Импульс",
    target: "Реактивная сила",
  },
  {
    id: "e47",
    source: "Импульс",
    target: "Столкновения",
  },
  {
    id: "e48",
    source: "Столкновения",
    target: "Тур. Законы сохранения, 9 класс.",
  },
  {
    id: "e49",
    source: "Реактивная сила",
    target: "Тур. Законы сохранения, 9 класс.",
  },
  {
    id: "e50",
    source: "Всемирное тяготение. Космические скорости.",
    target: "Тур. Динамика, 9 класс.",
  },
  {
    id: "e51",
    source: "Вращательные НеИСО",
    target: "Тур. Динамика, 9 класс.",
  },
  {
    id: "e52",
    source: "Сухое трение",
    target: "Тур. Динамика, 9 класс.",
  },
  {
    id: "e53",
    source: "Тур. Динамика, 9 класс.",
    target: "Момент импульса",
  },
  {
    id: "e54",
    source: "Тур. Законы сохранения, 9 класс.",
    target: "Момент импульса",
  },
  {
    id: "e55",
    source: "Момент импульса",
    target: "Момент инерции",
  },
  {
    id: "e56",
    source: "Момент импульса",
    target: "Гравитация. Законы Кеплера.",
  },
  {
    id: "e57",
    source: "Момент инерции",
    target: "Тур. Механика, 11 класс.",
  },
  {
    id: "e58",
    source: "Гравитация. Законы Кеплера.",
    target: "Тур. Механика, 11 класс.",
  },
  {
    id: "e59",
    source: "Устойчивость равновесия",
    target: "Гармонические колебания",
  },
  {
    id: "e60",
    source: "Гармонические колебания",
    target: "Энергия в гармонических колебаниях",
  },
  {
    id: "e61",
    source: "Энергия в гармонических колебаниях",
    target: "Затухающие колебания",
  },
  {
    id: "e62",
    source: "Затухающие колебания",
    target: "Резонанс",
  },
  {
    id: "e63",
    source: "Резонанс",
    target: "Сложение колебаний. Биения.",
  },
  {
    id: "e64",
    source: "Сложение колебаний. Биения.",
    target: "Тур. Колебания, 11 класс",
  },
  {
    id: "e65",
    source: "Сложение колебаний. Биения.",
    target: "Механические волны",
  },
  {
    id: "e66",
    source: "Сложение колебаний. Биения.",
    target: "Постулаты специальной теории относительности",
  },
  {
    id: "e67",
    source: "Механические волны",
    target: "Эффект Доплера",
  },
  {
    id: "e68",
    source: "Постулаты специальной теории относительности",
    target: "Парадоксы и эффекты",
  },
  {
    id: "e69",
    source: "Парадоксы и эффекты",
    target: "Релятивистская динамика",
  },
  {
    id: "e70",
    source: "Работа с графиками",
    target: "Тригонометрия",
  },
  {
    id: "e71",
    source: "Тригонометрия",
    target: "Векторы",
  },
  {
    id: "e72",
    source: "Векторы",
    target: "Свойства тригонометрических функций",
  },
  {
    id: "e73",
    source: "Свойства тригонометрических функций",
    target: "Дифференцирование",
  },
  {
    id: "e74",
    source: "Дифференцирование",
    target: "Интегрирование",
  },
  {
    id: "e75",
    source: "Интегрирование",
    target: "Работа с малыми величинами",
  },
  {
    id: "e76",
    source: "Телесный угол",
    target: "Логарифмы, показательные функции",
  },
  {
    id: "e77",
    source: "Работа с малыми величинами",
    target: "Телесный угол",
  },
  {
    id: "e78",
    source: "Логарифмы, показательные функции",
    target: "Векторное произведение",
  },
  {
    id: "e79",
    source: "Векторное произведение",
    target: "Дифференциальные уравнения. Уравнения колебаний.",
  },
  {
    id: "e80",
    source: "Дифференциальные уравнения. Уравнения колебаний.",
    target: "Ряды",
  },
  {
    id: "e81",
    source: "Ряды",
    target: "Комплексные числа",
  },
  {
    id: "e82",
    source: "Тень. Полутень.",
    target: "Отражение света. Зеркала.",
  },
  {
    id: "e83",
    source: "Отражение света. Зеркала.",
    target: "Преломление света. Закон Снеллиуса.",
  },
  {
    id: "e84",
    source: "Преломление света. Закон Снеллиуса.",
    target: "Пластины, призмы",
  },
  {
    id: "e85",
    source: "Пластины, призмы",
    target: "Полное внутреннее отражение",
  },
  {
    id: "e86",
    source: "Полное внутреннее отражение",
    target: "Линза, построение изображений",
  },
  {
    id: "e87",
    source: "Линза, построение изображений",
    target: "Формула тонкой линзы",
  },
  {
    id: "e88",
    source: "Формула тонкой линзы",
    target: "Увеличение",
  },
  {
    id: "e89",
    source: "Увеличение",
    target: "Оптические системы",
  },
  {
    id: "e90",
    source: "Оптические системы",
    target: "Тур. Оптика, 10 класс.",
  },
  {
    id: "e91",
    source: "Тур. Оптика, 10 класс.",
    target: "Дисперсия",
  },
  {
    id: "e92",
    source: "Дисперсия",
    target: "Интерференция света. Когерентные источники.",
  },
  {
    id: "e93",
    source: "Интерференция света. Когерентные источники.",
    target: "Интерференция света. Временная когерентность.",
  },
  {
    id: "e94",
    source: "Интерференция света. Временная когерентность.",
    target: "Дифракция Фраунгофера",
  },
  {
    id: "e95",
    source: "Дифракция Фраунгофера",
    target: "Дифракция Френеля",
  },
  {
    id: "e96",
    source: "Дифракция Френеля",
    target: "Дифракционная решётка",
  },
  {
    id: "e97",
    source: "Дифракционная решётка",
    target: "Поляризация света",
  },
  {
    id: "e98",
    source: "Поляризация света",
    target: "Тур. Волновая оптика, 11 класс",
  },
  {
    id: "e99",
    source: "Электрический заряд. Закон Кулона.",
    target: "Напряжённость электрического поля, потенциал",
  },
  {
    id: "e100",
    source: "Напряжённость электрического поля, потенциал",
    target: "Сила тока, напряжение. Закон Ома.",
  },
  {
    id: "e101",
    source: "Параллельное и последовательное соединения резисторов",
    target: "Мощность электрического тока",
  },
  {
    id: "e103",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Параллельное и последовательное соединения резисторов",
  },
  {
    id: "e104",
    source: "Мощность электрического тока",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e105",
    source: "Теорема Кёнига",
    target: "Тур. Движение твёрдого тела, 9 класс",
  },
  {
    id: "e106",
    source: "Параллельное и последовательное соединения резисторов",
    target: "Правила Кирхгофа",
  },
  {
    id: "e107",
    source: "Правила Кирхгофа",
    target: "Симметричные цепи",
  },
  {
    id: "e108",
    source: "Правила Кирхгофа",
    target: "Источники тока",
  },
  {
    id: "e109",
    source: "Симметричные цепи",
    target: "Метод наложения токов",
  },
  {
    id: "e110",
    source: "Источники тока",
    target: "Метод эквивалентного источника",
  },
  {
    id: "e111",
    source: "Источники тока",
    target: "Измерительные приборы",
  },
  {
    id: "e112",
    source: "Измерительные приборы",
    target: "Вольтамперная характеристика",
  },
  {
    id: "e113",
    source: "Измерительные приборы",
    target: "Мостовые схемы",
  },
  {
    id: "e114",
    source: "Мостовые схемы",
    target: "Преобразование звезда-треугольник",
  },
  {
    id: "e115",
    source: "Бесконечные цепи",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e116",
    source: "Метод эквивалентного источника",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e117",
    source: "Вольтамперная характеристика",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e118",
    source: "Преобразование звезда-треугольник",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e119",
    source: "Тур. Электричество, 8 класс.",
    target: "Поток электрического поля. Теорема Гаусса.",
  },
  {
    id: "e120",
    source: "Поток электрического поля. Теорема Гаусса.",
    target: "Теорема о единственности. Проводники в электростатическом поле.",
  },
  {
    id: "e123",
    source: "Теорема о единственности. Проводники в электростатическом поле.",
    target: "Метод электростатических изображений",
  },
  {
    id: "e125",
    source: "Метод электростатических изображений",
    target: "Энергия систем зарядов",
  },
  {
    id: "e126",
    source: "Энергия систем зарядов",
    target: "Диэлектрики в электростатическом поле",
  },
  {
    id: "e127",
    source: "Диэлектрики в электростатическом поле",
    target: "Тур. Электростатика, 10 класс.",
  },
  {
    id: "e128",
    source: "Тур. Электростатика, 10 класс.",
    target: "Конденсаторы",
  },
  {
    id: "e129",
    source: "Конденсаторы",
    target: "Соединение конденсаторов. Энергия конденсатора.",
  },
  {
    id: "e130",
    source: "Соединение конденсаторов. Энергия конденсатора.",
    target: "Объёмная плотность энергии электрического поля",
  },
  {
    id: "e131",
    source: "Объёмная плотность энергии электрического поля",
    target: "RC-цепи",
  },
  {
    id: "e132",
    source: "RC-цепи",
    target: "Ток в различных средах",
  },
  {
    id: "e133",
    source: "Ток в различных средах",
    target: "Тур. Электростатика, 11 класс.",
  },
  {
    id: "e134",
    source: "Тур. Электростатика, 11 класс.",
    target: "Магнитное поле. Сила Лоренца.",
  },
  {
    id: "e135",
    source: "Магнитное поле. Сила Лоренца.",
    target: "Сила Ампера. Момент силы Ампера.",
  },
  {
    id: "e136",
    source: "Сила Ампера. Момент силы Ампера.",
    target: "Закон Био-Савара-Лапласа",
  },
  {
    id: "e137",
    source: "Закон Био-Савара-Лапласа",
    target: "Теорема Гаусса для магнитного поля",
  },
  {
    id: "e138",
    source: "Теорема Гаусса для магнитного поля",
    target: "Теорема о циркуляции магнитного поля",
  },
  {
    id: "e139",
    source: "Теорема о циркуляции магнитного поля",
    target: "Закон электромагнитной индукции Фарадея",
  },
  {
    id: "e140",
    source: "Закон электромагнитной индукции Фарадея",
    target: "Движущийся проводник в магнитном поле",
  },
  {
    id: "e141",
    source: "Движущийся проводник в магнитном поле",
    target: "Магнитная гидродинамика",
  },
  {
    id: "e142",
    source: "Магнитная гидродинамика",
    target: "Эффект Холла",
  },
  {
    id: "e143",
    source: "Эффект Холла",
    target: "Самоиндукция",
  },
  {
    id: "e144",
    source: "Самоиндукция",
    target: "Энергия магнитного поля",
  },
  {
    id: "e145",
    source: "Энергия магнитного поля",
    target: "Тур. Электромагнетизм, 11 класс.",
  },
  {
    id: "e146",
    source: "Тур. Электромагнетизм, 11 класс.",
    target: "Электромагнитные волны",
  },
  {
    id: "e147",
    source: "Тур. Электромагнетизм, 11 класс.",
    target: "Переменный ток. Импеданс.",
  },
  {
    id: "e148",
    source: "Электромагнитные волны",
    target: "Интерференция и дифракция ЭМ волн",
  },
  {
    id: "e149",
    source: "Интерференция и дифракция ЭМ волн",
    target: "Дисперсия",
  },
  {
    id: "e150",
    source: "Интерференция и дифракция ЭМ волн",
    target: "Импульс и энергия фотонов",
  },
  {
    id: "e151",
    source: "Импульс и энергия фотонов",
    target: "Фотоэффект",
  },
  {
    id: "e152",
    source: "Фотоэффект",
    target: "Корпускулярно-волновой дуализм",
  },
  {
    id: "e153",
    source: "Корпускулярно-волновой дуализм",
    target: "Соотношение неопределённостей Гейзенберга",
  },
  {
    id: "e154",
    source: "Переменный ток. Импеданс.",
    target: "Резонанс. Мощность переменного тока",
  },
  {
    id: "e155",
    source: "Резонанс. Мощность переменного тока",
    target: "Тур. Переменный ток, 11 класc",
  },
  {
    id: "e156",
    source:
      "Температура. Связь температуры с кинетической энергией движения молекул.",
    target: "Тепловое расширение",
  },
  {
    id: "e157",
    source:
      "Температура. Связь температуры с кинетической энергией движения молекул.",
    target: "Количество теплоты, внутренняя энергия",
  },
  {
    id: "e158",
    source: "Количество теплоты, внутренняя энергия",
    target: "Влажность",
  },
  {
    id: "e159",
    source: "Количество теплоты, внутренняя энергия",
    target: "Уравнение теплового баланса",
  },
  {
    id: "e160",
    source: "Уравнение теплового баланса",
    target: "Внешние источники теплоты. Теплопотери.",
  },
  {
    id: "e161",
    source: "Внешние источники теплоты. Теплопотери.",
    target: "Теплопроводность. Закон Ньютона-Рихмана.",
  },
  {
    id: "e162",
    source: "Теплопроводность. Закон Ньютона-Рихмана.",
    target: "Тур. Термодинамика, 8 класс.",
  },
  {
    id: "e163",
    source: "Влажность",
    target: "Тур. Термодинамика, 8 класс.",
  },
  {
    id: "e164",
    source: "Тепловое расширение",
    target: "Тур. Термодинамика, 8 класс.",
  },
  {
    id: "e165",
    source: "Тур. Термодинамика, 8 класс.",
    target: "Длина свободного пробега",
  },
  {
    id: "e166",
    source: "Длина свободного пробега",
    target: "Уравнение Клапейрона-Менделеева",
  },
  {
    id: "e167",
    source: "Уравнение Клапейрона-Менделеева",
    target: "Работа, внутренняя энергия. Первое начало термодинамики.",
  },
  {
    id: "e168",
    source: "Работа, внутренняя энергия. Первое начало термодинамики.",
    target: "Адиабатический процесс",
  },
  {
    id: "e169",
    source: "Адиабатический процесс",
    target: "Политропический процесс",
  },
  {
    id: "e170",
    source: "Политропический процесс",
    target: "Термодинамические циклы",
  },
  {
    id: "e171",
    source: "Термодинамические циклы",
    target: "Второе начало термодинамики. Цикл Карно.",
  },
  {
    id: "e172",
    source: "Второе начало термодинамики. Цикл Карно.",
    target: "Теоремы Карно",
  },
  {
    id: "e174",
    source: "Теоремы Карно",
    target: "Неравенство Клаузиуса",
  },
  {
    id: "e175",
    source: "Теоремы Карно",
    target: "Влажный воздух",
  },
  {
    id: "e176",
    source: "Неравенство Клаузиуса",
    target: "Энтропия",
  },
  {
    id: "e177",
    source: "Влажный воздух",
    target: "Уравнение Клапейрона-Клаузиуса",
  },
  {
    id: "e178",
    source: "Уравнение Клапейрона-Клаузиуса",
    target: "Неидеальные газы",
  },
  {
    id: "e179",
    source: "Неидеальные газы",
    target: "Тур. Термодинамика, 10 класс.",
  },
  {
    id: "e180",
    source: "Энтропия",
    target: "Тур. Термодинамика, 10 класс.",
  },
  {
    id: "e181",
    source: "Тур. Термодинамика, 10 класс.",
    target: "Поверхностное натяжение",
  },
  {
    id: "e182",
    source: "Поверхностное натяжение",
    target: "Равновесное тепловое излучение",
  },
  {
    id: "e183",
    source: "Сила тяжести",
    target: "Трение",
  },
  {
    id: "e184",
    source: "Трение",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e185",
    source: "Метод наложения токов",
    target: "Бесконечные цепи",
  },
];