export const rawNodes = [
  {
    "id": "TheSolution",
    "data": {
      "section": "",
      "grade": "11"
    },
    "position": {
      "x": 7620,
      "y": -1980
    },
    "width": 600,
    "height": 400
  },
  {
    "id": "Равномерное прямолинейное движение",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Плотность",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 6480,
      "y": 600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа с графиками",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Электрический заряд. Закон Кулона.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8320,
      "y": 540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Температура. Связь температуры с кинетической энергией движения молекул.",
    "data": {
      "section": "термодинамика",
      "grade": "10"
    },
    "position": {
      "x": 13180,
      "y": 540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тень. Полутень.",
    "data": {
      "section": "оптика",
      "grade": "7"
    },
    "position": {
      "x": 11660,
      "y": 480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Средняя скорость. Относительное движение.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 800
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Кинематические связи. Блоки.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 1000
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Закон Гука. Системы пружин.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 1500
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила. Третий закон Ньютона.",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 6480,
      "y": 800
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила тяжести",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 6480,
      "y": 1000
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Моменты",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5220,
      "y": 1720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа. Мощность. КПД",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 1720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Системы блоков. Статика со связями.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5220,
      "y": 1920
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Давление. Сообщающиеся сосуды",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 6480,
      "y": 1500
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила Архимеда",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 6480,
      "y": 1700
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Механика, 7 класс.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 2180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 4800,
      "y": 2900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Движение со связями",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5300,
      "y": 2900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Равноускоренное движение",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 2900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Конус Маха",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 6300,
      "y": 2900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Упругие столкновения с тяжёлой стенкой",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 6800,
      "y": 2900
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод виртуальных перемещений",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3480,
      "y": 3720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Бернулли",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3980,
      "y": 3720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Устойчивость равновесия",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 3720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Мгновенный центр вращения",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5460,
      "y": 3260
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема Кёнига",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5080,
      "y": 3720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Динамика. Второй закон Ньютона.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4820,
      "y": 6660
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Равномерное движение по окружности",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 3360
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Баллистика. Координатный метод.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 6300,
      "y": 3380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Баллистика. Векторный метод.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 6300,
      "y": 3580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Баллистика, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 6300,
      "y": 3780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Центростремительное ускорение",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 3580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неравномерное движение по окружности",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 3780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Всемирное тяготение. Космические скорости.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3440,
      "y": 7500
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неинерциальные системы отсчёта",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4100,
      "y": 7500
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Вращательные НеИСО",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4100,
      "y": 7700
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сухое трение",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4820,
      "y": 7480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Импульс",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5800,
      "y": 7480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Реактивная сила",
    "data": {
      "section": "механика",
      "grade": "7"
    },
    "position": {
      "x": 5560,
      "y": 7680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Вязкое трение",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4560,
      "y": 7720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Статика",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5060,
      "y": 7680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Столкновения",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 6060,
      "y": 7680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Законы сохранения, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 5840,
      "y": 7920
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Динамика, 9 класс.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4120,
      "y": 8220
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Момент импульса",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4120,
      "y": 8480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Момент инерции",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3860,
      "y": 8740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Гравитация. Законы Кеплера.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4380,
      "y": 8740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Механика, 11 класс.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4120,
      "y": 9040
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Гармонические колебания",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 3920
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия в гармонических колебаниях",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 4120
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Затухающие колебания",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 4320
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Резонанс",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 4520
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сложение колебаний. Биения.",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 4720
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Колебания, 11 класс",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3480,
      "y": 4940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Механические волны",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3980,
      "y": 4940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Постулаты специальной теории относительности",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 4940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Эффект Доплера",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 3980,
      "y": 5140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Парадоксы и эффекты",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 5140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Релятивистская динамика",
    "data": {
      "section": "механика",
      "grade": "9"
    },
    "position": {
      "x": 4480,
      "y": 5340
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тригонометрия",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Свойства тригонометрических функций",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Векторы",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 1140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифференцирование",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 1340
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интегрирование",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 1540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа с малыми величинами",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 1740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Логарифмы, показательные функции",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 1940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Телесный угол",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 2140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Векторное произведение",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 2340
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифференциальные уравнения. Уравнения колебаний.",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 2540
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Ряды",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 2740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Комплексные числа",
    "data": {
      "section": "математика",
      "grade": "7"
    },
    "position": {
      "x": 7720,
      "y": 2940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Отражение света. Зеркала.",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Преломление света. Закон Снеллиуса.",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Пластины, призмы",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 1080
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Полное внутреннее отражение",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 11660,
      "y": 1280
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Линза, построение изображений",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 1480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Формула тонкой линзы",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 11660,
      "y": 1680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Увеличение",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 1880
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Оптические системы",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 2080
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Оптика, 10 класс.",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 11660,
      "y": 10940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дисперсия",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 11980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интерференция света. Когерентные источники.",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 12180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интерференция света. Временная когерентность.",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 12380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифракция Фраунгофера",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 12580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифракция Френеля",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 12780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дифракционная решётка",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 12980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Поляризация света",
    "data": {
      "section": "оптика",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 13180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Волновая оптика, 11 класс",
    "data": {
      "section": "оптика",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 13380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Напряжённость электрического поля, потенциал",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8320,
      "y": 740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила тока, напряжение. Закон Ома.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8320,
      "y": 940
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Мощность электрического тока",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8340,
      "y": 4620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электричество, 8 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 5380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Удельное сопротивление",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8840,
      "y": 4620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Параллельное и последовательное соединения резисторов",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9340,
      "y": 2140
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Правила Кирхгофа",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9340,
      "y": 2340
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Симметричные цепи",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9340,
      "y": 4380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод наложения токов",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9340,
      "y": 4620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Источники тока",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9840,
      "y": 2740
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод эквивалентного источника",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9840,
      "y": 4620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Измерительные приборы",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 10340,
      "y": 3120
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Вольтамперная характеристика",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 10340,
      "y": 4620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Мостовые схемы",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 10920,
      "y": 4420
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Преобразование звезда-треугольник",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 10920,
      "y": 4620
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Поток электрического поля. Закон Гаусса.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 5580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Рассчёт электрического поля и потенциала",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 5780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Принцип суперпозиции",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 5980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Проводники в электростатическом поле",
    "data": {
      "section": "электромагнетизм",
      "grade": "10"
    },
    "position": {
      "x": 9680,
      "y": 6180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема о единственности",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 6380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Метод электростатических изображений",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 6580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия систем зарядов",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 6780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Диэлектрики в электростатическом поле",
    "data": {
      "section": "электромагнетизм",
      "grade": "10"
    },
    "position": {
      "x": 9680,
      "y": 6980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электростатика, 10 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 7180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Конденсаторы",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 7380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Соединение конденсаторов. Энергия конденсатора.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 7580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Объёмная плотность энергии электрического поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 7780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "RC-цепи",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 7980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Ток в различных средах",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 8180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электростатика, 11 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 8380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Магнитное поле. Сила Лоренца.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 8580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Сила Ампера. Момент силы Ампера.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 8780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Закон Био-Савара-Лапласа",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 8980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема Гаусса для магнитного поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 9180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теорема о циркуляции магнитного поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 9380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Закон электромагнитной индукции Фарадея",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 9580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Движущийся проводник в магнитном поле",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 9780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Магнитная гидродинамика",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 9980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Эффект Холла",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 10180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Самоиндукция",
    "data": {
      "section": "электромагнетизм",
      "grade": "11"
    },
    "position": {
      "x": 9680,
      "y": 10380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энергия магнитного поля",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 10580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Электромагнетизм, 11 класс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 10780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Электромагнитные волны",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8680,
      "y": 10980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Интерференция и дифракция ЭМ волн",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8680,
      "y": 11180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Дисперсия",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 11980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Импульс и энергия фотонов",
    "data": {
      "section": "электромагнетизм",
      "grade": "11"
    },
    "position": {
      "x": 8180,
      "y": 11380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Фотоэффект",
    "data": {
      "section": "электромагнетизм",
      "grade": "11"
    },
    "position": {
      "x": 8180,
      "y": 11580
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Корпускулярно-волновой дуализм",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8180,
      "y": 11780
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Соотношение неопределённостей Гейзенберга",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 8180,
      "y": 11980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Переменный ток. Импеданс.",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 10980
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Резонанс. Мощность переменного тока",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 11180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Переменный ток, 11 класc",
    "data": {
      "section": "электромагнетизм",
      "grade": "8"
    },
    "position": {
      "x": 9680,
      "y": 11380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тепловое расширение",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 12680,
      "y": 1220
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Количество теплоты, внутренняя энергия",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 1020
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Влажность",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 1220
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Уравнение теплового баланса",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13680,
      "y": 1220
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Внешние источники теплоты. Теплопотери.",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13680,
      "y": 1400
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теплопроводность. Закон Ньютона-Рихмана.",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13680,
      "y": 1600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Термодинамика, 8 класс.",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 2000
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Длина свободного пробега",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 2200
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Уравнение Клапейрона-Менделеева",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 2400
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Работа, внутренняя энергия. Первое начало термодинамики.",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 2600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Адиабатический процесс",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 2800
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Политропический процесс",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 3000
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Термодинамические циклы",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 3200
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Второе начало термодинамики. Две формулировки.",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 3400
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Цикл Карно",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 3600
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Теоремы Карно",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 3800
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неравенство Клаузиуса",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 12820,
      "y": 4280
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Энтропия",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 12820,
      "y": 4680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Влажный воздух",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13520,
      "y": 4280
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Уравнение Клапейрона-Клаузиуса",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13520,
      "y": 4480
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Неидеальные газы",
    "data": {
      "section": "термодинамика",
      "grade": "10"
    },
    "position": {
      "x": 13520,
      "y": 4680
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Тур. Термодинамика, 10 класс.",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 5180
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Поверхностное натяжение",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 5380
    },
    "width": 320,
    "height": 300
  },
  {
    "id": "Равновесное тепловое излучение",
    "data": {
      "section": "термодинамика",
      "grade": "8"
    },
    "position": {
      "x": 13180,
      "y": 5580
    },
    "width": 320,
    "height": 300
  }
];
export const rawEdges = [
  {
    id: "e0",
    source: "TheSolution",
    target: "Равномерное прямолинейное движение",
  },
  {
    id: "e1",
    source: "TheSolution",
    target: "Плотность",
  },
  {
    id: "e2",
    source: "TheSolution",
    target: "Работа с графиками",
  },
  {
    id: "e3",
    source: "TheSolution",
    target: "Электрический заряд. Закон Кулона.",
  },
  {
    id: "e4",
    source: "TheSolution",
    target:
      "Температура. Связь температуры с кинетической энергией движения молекул.",
  },
  {
    id: "e5",
    source: "TheSolution",
    target: "Тень. Полутень.",
  },
  {
    id: "e6",
    source: "Равномерное прямолинейное движение",
    target: "Средняя скорость. Относительное движение.",
  },
  {
    id: "e7",
    source: "Средняя скорость. Относительное движение.",
    target: "Кинематические связи. Блоки.",
  },
  {
    id: "e8",
    source: "Кинематические связи. Блоки.",
    target: "Закон Гука. Системы пружин.",
  },
  {
    id: "e9",
    source: "Плотность",
    target: "Сила. Третий закон Ньютона.",
  },
  {
    id: "e10",
    source: "Сила. Третий закон Ньютона.",
    target: "Сила тяжести",
  },
  {
    id: "e11",
    source: "Сила тяжести",
    target: "Закон Гука. Системы пружин.",
  },
  {
    id: "e12",
    source: "Сила тяжести",
    target: "Давление. Сообщающиеся сосуды",
  },
  {
    id: "e13",
    source: "Закон Гука. Системы пружин.",
    target: "Моменты",
  },
  {
    id: "e14",
    source: "Закон Гука. Системы пружин.",
    target: "Работа. Мощность. КПД",
  },
  {
    id: "e15",
    source: "Моменты",
    target: "Системы блоков. Статика со связями.",
  },
  {
    id: "e16",
    source: "Давление. Сообщающиеся сосуды",
    target: "Сила Архимеда",
  },
  {
    id: "e17",
    source: "Работа. Мощность. КПД",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e18",
    source: "Системы блоков. Статика со связями.",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e19",
    source: "Сила Архимеда",
    target: "Тур. Механика, 7 класс.",
  },
  {
    id: "e20",
    source: "Тур. Механика, 7 класс.",
    target: "Энергия",
  },
  {
    id: "e21",
    source: "Тур. Механика, 7 класс.",
    target: "Движение со связями",
  },
  {
    id: "e22",
    source: "Тур. Механика, 7 класс.",
    target: "Равноускоренное движение",
  },
  {
    id: "e23",
    source: "Тур. Механика, 7 класс.",
    target: "Конус Маха",
  },
  {
    id: "e24",
    source: "Тур. Механика, 7 класс.",
    target: "Упругие столкновения с тяжёлой стенкой",
  },
  {
    id: "e25",
    source: "Энергия",
    target: "Метод виртуальных перемещений",
  },
  {
    id: "e26",
    source: "Энергия",
    target: "Бернулли",
  },
  {
    id: "e27",
    source: "Энергия",
    target: "Устойчивость равновесия",
  },
  {
    id: "e28",
    source: "Энергия",
    target: "Теорема Кёнига",
  },
  {
    id: "e29",
    source: "Энергия",
    target: "Динамика. Второй закон Ньютона.",
  },
  {
    id: "e30",
    source: "Движение со связями",
    target: "Мгновенный центр вращения",
  },
  {
    id: "e31",
    source: "Мгновенный центр вращения",
    target: "Теорема Кёнига",
  },
  {
    id: "e32",
    source: "Равноускоренное движение",
    target: "Равномерное движение по окружности",
  },
  {
    id: "e33",
    source: "Равноускоренное движение",
    target: "Баллистика. Координатный метод.",
  },
  {
    id: "e34",
    source: "Баллистика. Координатный метод.",
    target: "Баллистика. Векторный метод.",
  },
  {
    id: "e35",
    source: "Баллистика. Векторный метод.",
    target: "Тур. Баллистика, 9 класс.",
  },
  {
    id: "e36",
    source: "Равномерное движение по окружности",
    target: "Центростремительное ускорение",
  },
  {
    id: "e37",
    source: "Центростремительное ускорение",
    target: "Неравномерное движение по окружности",
  },
  {
    id: "e38",
    source: "Неравномерное движение по окружности",
    target: "Динамика. Второй закон Ньютона.",
  },
  {
    id: "e39",
    source: "Динамика. Второй закон Ньютона.",
    target: "Всемирное тяготение. Космические скорости.",
  },
  {
    id: "e40",
    source: "Динамика. Второй закон Ньютона.",
    target: "Неинерциальные системы отсчёта",
  },
  {
    id: "e41",
    source: "Динамика. Второй закон Ньютона.",
    target: "Сухое трение",
  },
  {
    id: "e42",
    source: "Динамика. Второй закон Ньютона.",
    target: "Импульс",
  },
  {
    id: "e43",
    source: "Неинерциальные системы отсчёта",
    target: "Вращательные НеИСО",
  },
  {
    id: "e44",
    source: "Сухое трение",
    target: "Вязкое трение",
  },
  {
    id: "e45",
    source: "Сухое трение",
    target: "Статика",
  },
  {
    id: "e46",
    source: "Импульс",
    target: "Реактивная сила",
  },
  {
    id: "e47",
    source: "Импульс",
    target: "Столкновения",
  },
  {
    id: "e48",
    source: "Столкновения",
    target: "Тур. Законы сохранения, 9 класс.",
  },
  {
    id: "e49",
    source: "Реактивная сила",
    target: "Тур. Законы сохранения, 9 класс.",
  },
  {
    id: "e50",
    source: "Всемирное тяготение. Космические скорости.",
    target: "Тур. Динамика, 9 класс.",
  },
  {
    id: "e51",
    source: "Вращательные НеИСО",
    target: "Тур. Динамика, 9 класс.",
  },
  {
    id: "e52",
    source: "Статика",
    target: "Тур. Динамика, 9 класс.",
  },
  {
    id: "e53",
    source: "Тур. Динамика, 9 класс.",
    target: "Момент импульса",
  },
  {
    id: "e54",
    source: "Тур. Законы сохранения, 9 класс.",
    target: "Момент импульса",
  },
  {
    id: "e55",
    source: "Момент импульса",
    target: "Момент инерции",
  },
  {
    id: "e56",
    source: "Момент импульса",
    target: "Гравитация. Законы Кеплера.",
  },
  {
    id: "e57",
    source: "Момент инерции",
    target: "Тур. Механика, 11 класс.",
  },
  {
    id: "e58",
    source: "Гравитация. Законы Кеплера.",
    target: "Тур. Механика, 11 класс.",
  },
  {
    id: "e59",
    source: "Устойчивость равновесия",
    target: "Гармонические колебания",
  },
  {
    id: "e60",
    source: "Гармонические колебания",
    target: "Энергия в гармонических колебаниях",
  },
  {
    id: "e61",
    source: "Энергия в гармонических колебаниях",
    target: "Затухающие колебания",
  },
  {
    id: "e62",
    source: "Затухающие колебания",
    target: "Резонанс",
  },
  {
    id: "e63",
    source: "Резонанс",
    target: "Сложение колебаний. Биения.",
  },
  {
    id: "e64",
    source: "Сложение колебаний. Биения.",
    target: "Тур. Колебания, 11 класс",
  },
  {
    id: "e65",
    source: "Сложение колебаний. Биения.",
    target: "Механические волны",
  },
  {
    id: "e66",
    source: "Сложение колебаний. Биения.",
    target: "Постулаты специальной теории относительности",
  },
  {
    id: "e67",
    source: "Механические волны",
    target: "Эффект Доплера",
  },
  {
    id: "e68",
    source: "Постулаты специальной теории относительности",
    target: "Парадоксы и эффекты",
  },
  {
    id: "e69",
    source: "Парадоксы и эффекты",
    target: "Релятивистская динамика",
  },
  {
    id: "e70",
    source: "Работа с графиками",
    target: "Тригонометрия",
  },
  {
    id: "e71",
    source: "Тригонометрия",
    target: "Свойства тригонометрических функций",
  },
  {
    id: "e72",
    source: "Свойства тригонометрических функций",
    target: "Векторы",
  },
  {
    id: "e73",
    source: "Векторы",
    target: "Дифференцирование",
  },
  {
    id: "e74",
    source: "Дифференцирование",
    target: "Интегрирование",
  },
  {
    id: "e75",
    source: "Интегрирование",
    target: "Работа с малыми величинами",
  },
  {
    id: "e76",
    source: "Работа с малыми величинами",
    target: "Логарифмы, показательные функции",
  },
  {
    id: "e77",
    source: "Логарифмы, показательные функции",
    target: "Телесный угол",
  },
  {
    id: "e78",
    source: "Телесный угол",
    target: "Векторное произведение",
  },
  {
    id: "e79",
    source: "Векторное произведение",
    target: "Дифференциальные уравнения. Уравнения колебаний.",
  },
  {
    id: "e80",
    source: "Дифференциальные уравнения. Уравнения колебаний.",
    target: "Ряды",
  },
  {
    id: "e81",
    source: "Ряды",
    target: "Комплексные числа",
  },
  {
    id: "e82",
    source: "Тень. Полутень.",
    target: "Отражение света. Зеркала.",
  },
  {
    id: "e83",
    source: "Отражение света. Зеркала.",
    target: "Преломление света. Закон Снеллиуса.",
  },
  {
    id: "e84",
    source: "Преломление света. Закон Снеллиуса.",
    target: "Пластины, призмы",
  },
  {
    id: "e85",
    source: "Пластины, призмы",
    target: "Полное внутреннее отражение",
  },
  {
    id: "e86",
    source: "Полное внутреннее отражение",
    target: "Линза, построение изображений",
  },
  {
    id: "e87",
    source: "Линза, построение изображений",
    target: "Формула тонкой линзы",
  },
  {
    id: "e88",
    source: "Формула тонкой линзы",
    target: "Увеличение",
  },
  {
    id: "e89",
    source: "Увеличение",
    target: "Оптические системы",
  },
  {
    id: "e90",
    source: "Оптические системы",
    target: "Тур. Оптика, 10 класс.",
  },
  {
    id: "e91",
    source: "Тур. Оптика, 10 класс.",
    target: "Дисперсия",
  },
  {
    id: "e92",
    source: "Дисперсия",
    target: "Интерференция света. Когерентные источники.",
  },
  {
    id: "e93",
    source: "Интерференция света. Когерентные источники.",
    target: "Интерференция света. Временная когерентность.",
  },
  {
    id: "e94",
    source: "Интерференция света. Временная когерентность.",
    target: "Дифракция Фраунгофера",
  },
  {
    id: "e95",
    source: "Дифракция Фраунгофера",
    target: "Дифракция Френеля",
  },
  {
    id: "e96",
    source: "Дифракция Френеля",
    target: "Дифракционная решётка",
  },
  {
    id: "e97",
    source: "Дифракционная решётка",
    target: "Поляризация света",
  },
  {
    id: "e98",
    source: "Поляризация света",
    target: "Тур. Волновая оптика, 11 класс",
  },
  {
    id: "e99",
    source: "Электрический заряд. Закон Кулона.",
    target: "Напряжённость электрического поля, потенциал",
  },
  {
    id: "e100",
    source: "Напряжённость электрического поля, потенциал",
    target: "Сила тока, напряжение. Закон Ома.",
  },
  {
    id: "e101",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Мощность электрического тока",
  },
  {
    id: "e102",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Удельное сопротивление",
  },
  {
    id: "e103",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Параллельное и последовательное соединения резисторов",
  },
  {
    id: "e104",
    source: "Мощность электрического тока",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e105",
    source: "Удельное сопротивление",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e106",
    source: "Параллельное и последовательное соединения резисторов",
    target: "Правила Кирхгофа",
  },
  {
    id: "e107",
    source: "Правила Кирхгофа",
    target: "Симметричные цепи",
  },
  {
    id: "e108",
    source: "Правила Кирхгофа",
    target: "Источники тока",
  },
  {
    id: "e109",
    source: "Симметричные цепи",
    target: "Метод наложения токов",
  },
  {
    id: "e110",
    source: "Источники тока",
    target: "Метод эквивалентного источника",
  },
  {
    id: "e111",
    source: "Источники тока",
    target: "Измерительные приборы",
  },
  {
    id: "e112",
    source: "Измерительные приборы",
    target: "Вольтамперная характеристика",
  },
  {
    id: "e113",
    source: "Измерительные приборы",
    target: "Мостовые схемы",
  },
  {
    id: "e114",
    source: "Мостовые схемы",
    target: "Преобразование звезда-треугольник",
  },
  {
    id: "e115",
    source: "Метод наложения токов",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e116",
    source: "Метод эквивалентного источника",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e117",
    source: "Вольтамперная характеристика",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e118",
    source: "Преобразование звезда-треугольник",
    target: "Тур. Электричество, 8 класс.",
  },
  {
    id: "e119",
    source: "Тур. Электричество, 8 класс.",
    target: "Поток электрического поля. Закон Гаусса.",
  },
  {
    id: "e120",
    source: "Поток электрического поля. Закон Гаусса.",
    target: "Рассчёт электрического поля и потенциала",
  },
  {
    id: "e121",
    source: "Рассчёт электрического поля и потенциала",
    target: "Принцип суперпозиции",
  },
  {
    id: "e122",
    source: "Принцип суперпозиции",
    target: "Проводники в электростатическом поле",
  },
  {
    id: "e123",
    source: "Проводники в электростатическом поле",
    target: "Теорема о единственности",
  },
  {
    id: "e124",
    source: "Теорема о единственности",
    target: "Метод электростатических изображений",
  },
  {
    id: "e125",
    source: "Метод электростатических изображений",
    target: "Энергия систем зарядов",
  },
  {
    id: "e126",
    source: "Энергия систем зарядов",
    target: "Диэлектрики в электростатическом поле",
  },
  {
    id: "e127",
    source: "Диэлектрики в электростатическом поле",
    target: "Тур. Электростатика, 10 класс.",
  },
  {
    id: "e128",
    source: "Тур. Электростатика, 10 класс.",
    target: "Конденсаторы",
  },
  {
    id: "e129",
    source: "Конденсаторы",
    target: "Соединение конденсаторов. Энергия конденсатора.",
  },
  {
    id: "e130",
    source: "Соединение конденсаторов. Энергия конденсатора.",
    target: "Объёмная плотность энергии электрического поля",
  },
  {
    id: "e131",
    source: "Объёмная плотность энергии электрического поля",
    target: "RC-цепи",
  },
  {
    id: "e132",
    source: "RC-цепи",
    target: "Ток в различных средах",
  },
  {
    id: "e133",
    source: "Ток в различных средах",
    target: "Тур. Электростатика, 11 класс.",
  },
  {
    id: "e134",
    source: "Тур. Электростатика, 11 класс.",
    target: "Магнитное поле. Сила Лоренца.",
  },
  {
    id: "e135",
    source: "Магнитное поле. Сила Лоренца.",
    target: "Сила Ампера. Момент силы Ампера.",
  },
  {
    id: "e136",
    source: "Сила Ампера. Момент силы Ампера.",
    target: "Закон Био-Савара-Лапласа",
  },
  {
    id: "e137",
    source: "Закон Био-Савара-Лапласа",
    target: "Теорема Гаусса для магнитного поля",
  },
  {
    id: "e138",
    source: "Теорема Гаусса для магнитного поля",
    target: "Теорема о циркуляции магнитного поля",
  },
  {
    id: "e139",
    source: "Теорема о циркуляции магнитного поля",
    target: "Закон электромагнитной индукции Фарадея",
  },
  {
    id: "e140",
    source: "Закон электромагнитной индукции Фарадея",
    target: "Движущийся проводник в магнитном поле",
  },
  {
    id: "e141",
    source: "Движущийся проводник в магнитном поле",
    target: "Магнитная гидродинамика",
  },
  {
    id: "e142",
    source: "Магнитная гидродинамика",
    target: "Эффект Холла",
  },
  {
    id: "e143",
    source: "Эффект Холла",
    target: "Самоиндукция",
  },
  {
    id: "e144",
    source: "Самоиндукция",
    target: "Энергия магнитного поля",
  },
  {
    id: "e145",
    source: "Энергия магнитного поля",
    target: "Тур. Электромагнетизм, 11 класс.",
  },
  {
    id: "e146",
    source: "Тур. Электромагнетизм, 11 класс.",
    target: "Электромагнитные волны",
  },
  {
    id: "e147",
    source: "Тур. Электромагнетизм, 11 класс.",
    target: "Переменный ток. Импеданс.",
  },
  {
    id: "e148",
    source: "Электромагнитные волны",
    target: "Интерференция и дифракция ЭМ волн",
  },
  {
    id: "e149",
    source: "Интерференция и дифракция ЭМ волн",
    target: "Дисперсия",
  },
  {
    id: "e150",
    source: "Интерференция и дифракция ЭМ волн",
    target: "Импульс и энергия фотонов",
  },
  {
    id: "e151",
    source: "Импульс и энергия фотонов",
    target: "Фотоэффект",
  },
  {
    id: "e152",
    source: "Фотоэффект",
    target: "Корпускулярно-волновой дуализм",
  },
  {
    id: "e153",
    source: "Корпускулярно-волновой дуализм",
    target: "Соотношение неопределённостей Гейзенберга",
  },
  {
    id: "e154",
    source: "Переменный ток. Импеданс.",
    target: "Резонанс. Мощность переменного тока",
  },
  {
    id: "e155",
    source: "Резонанс. Мощность переменного тока",
    target: "Тур. Переменный ток, 11 класc",
  },
  {
    id: "e156",
    source:
      "Температура. Связь температуры с кинетической энергией движения молекул.",
    target: "Тепловое расширение",
  },
  {
    id: "e157",
    source:
      "Температура. Связь температуры с кинетической энергией движения молекул.",
    target: "Количество теплоты, внутренняя энергия",
  },
  {
    id: "e158",
    source: "Количество теплоты, внутренняя энергия",
    target: "Влажность",
  },
  {
    id: "e159",
    source: "Количество теплоты, внутренняя энергия",
    target: "Уравнение теплового баланса",
  },
  {
    id: "e160",
    source: "Уравнение теплового баланса",
    target: "Внешние источники теплоты. Теплопотери.",
  },
  {
    id: "e161",
    source: "Внешние источники теплоты. Теплопотери.",
    target: "Теплопроводность. Закон Ньютона-Рихмана.",
  },
  {
    id: "e162",
    source: "Теплопроводность. Закон Ньютона-Рихмана.",
    target: "Тур. Термодинамика, 8 класс.",
  },
  {
    id: "e163",
    source: "Влажность",
    target: "Тур. Термодинамика, 8 класс.",
  },
  {
    id: "e164",
    source: "Тепловое расширение",
    target: "Тур. Термодинамика, 8 класс.",
  },
  {
    id: "e165",
    source: "Тур. Термодинамика, 8 класс.",
    target: "Длина свободного пробега",
  },
  {
    id: "e166",
    source: "Длина свободного пробега",
    target: "Уравнение Клапейрона-Менделеева",
  },
  {
    id: "e167",
    source: "Уравнение Клапейрона-Менделеева",
    target: "Работа, внутренняя энергия. Первое начало термодинамики.",
  },
  {
    id: "e168",
    source: "Работа, внутренняя энергия. Первое начало термодинамики.",
    target: "Адиабатический процесс",
  },
  {
    id: "e169",
    source: "Адиабатический процесс",
    target: "Политропический процесс",
  },
  {
    id: "e170",
    source: "Политропический процесс",
    target: "Термодинамические циклы",
  },
  {
    id: "e171",
    source: "Термодинамические циклы",
    target: "Второе начало термодинамики. Две формулировки.",
  },
  {
    id: "e172",
    source: "Второе начало термодинамики. Две формулировки.",
    target: "Цикл Карно",
  },
  {
    id: "e173",
    source: "Цикл Карно",
    target: "Теоремы Карно",
  },
  {
    id: "e174",
    source: "Теоремы Карно",
    target: "Неравенство Клаузиуса",
  },
  {
    id: "e175",
    source: "Теоремы Карно",
    target: "Влажный воздух",
  },
  {
    id: "e176",
    source: "Неравенство Клаузиуса",
    target: "Энтропия",
  },
  {
    id: "e177",
    source: "Влажный воздух",
    target: "Уравнение Клапейрона-Клаузиуса",
  },
  {
    id: "e178",
    source: "Уравнение Клапейрона-Клаузиуса",
    target: "Неидеальные газы",
  },
  {
    id: "e179",
    source: "Неидеальные газы",
    target: "Тур. Термодинамика, 10 класс.",
  },
  {
    id: "e180",
    source: "Энтропия",
    target: "Тур. Термодинамика, 10 класс.",
  },
  {
    id: "e181",
    source: "Тур. Термодинамика, 10 класс.",
    target: "Поверхностное натяжение",
  },
  {
    id: "e182",
    source: "Поверхностное натяжение",
    target: "Равновесное тепловое излучение",
  },
];
