export const rawNodes = [
  {
    id: "TS",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Равномерное прямолинейное движение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Плотность",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Работа с графиками",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Электрический заряд. Закон Кулона.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Температура. Связь температуры с кинетической энергией движения молекул.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тень. Полутень.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Средняя скорость. Относительное движение.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Кинематические связи. Блоки.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Закон Гука. Системы пружин.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сила. Третий закон Ньютона.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сила тяжести",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Моменты",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Работа. Мощность. КПД",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Системы блоков. Статика со связями.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Давление. Сообщающиеся сосуды",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сила Архимеда",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Механика, 7 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Энергия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Движение со связями",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Равноускоренное движение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Конус Маха",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Упругие столкновения с тяжёлой стенкой",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Метод виртуальных перемещений",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Бернулли",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Устойчивость равновесия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Мгновенный центр вращения",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Теорема Кёнига",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Динамика. Второй закон Ньютона.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Равномерное движение по окружности",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Баллистика. Координатный метод.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Баллистика. Векторный метод.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Баллистика, 9 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Центростремительное ускорение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Неравномерное движение по окружности",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Всемирное тяготение. Космические скорости.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Неинерциальные системы отсчёта",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Вращательные НеИСО",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сухое трение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Импульс",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Реактивная сила",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Вязкое трение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Статика",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Столкновения",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Законы сохранения, 9 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Динамика, 9 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Момент импульса",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Момент инерции",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Гравитация. Законы Кеплера.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Механика, 11 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Гармонические колебания",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Энергия в гармонических колебаниях",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Затухающие колебания",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Резонанс",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сложение колебаний. Биения.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Колебания, 11 класс",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Механические волны",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Постулаты специальной теории относительности",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Эффект Доплера",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Парадоксы и эффекты",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Релятивистская динамика",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тригонометрия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Свойства тригонометрических функций",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Векторы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дифференцирование",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Интегрирование",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Работа с малыми величинами",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Логарифмы, показательные функции",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Телесный угол",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Векторное произведение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дифференциальные уравнения. Уравнения колебаний.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Ряды",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Комплексные числа",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Отражение света. Зеркала.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Преломление света. Закон Снеллиуса.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Пластины, призмы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Полное внутреннее отражение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Линза, построение изображений",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Формула тонкой линзы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Увеличение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Оптические системы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Оптика, 10 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дисперсия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Интерференция света. Когерентные источники.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Интерференция света. Временная когерентность.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дифракция Фраунгофера",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дифракция Френеля",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дифракционная решётка",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Поляризация света",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Волновая оптика, 11 класс",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Напряжённость электрического поля, потенциал",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сила тока, напряжение. Закон Ома.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Мощность электрического тока",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Электричество, 8 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Удельное сопротивление",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Параллельное и последовательное соединения резисторов",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Правила Кирхгофа",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Симметричные цепи",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Метод наложения токов",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Источники тока",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Метод эквивалентного источника",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Измерительные приборы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Вольтамперная характеристика",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Мостовые схемы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Преобразование звезда-треугольник",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Поток электрического поля. Закон Гаусса.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Рассчёт электрического поля и потенциала",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Принцип суперпозиции",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Проводники в электростатическом поле",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Теорема о единственности",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Метод электростатических изображений",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Энергия систем зарядов",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Диэлектрики в электростатическом поле",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Электростатика, 10 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Конденсаторы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Соединение конденсаторов. Энергия конденсатора.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Объёмная плотность энергии электрического поля",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "RC-цепи",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Ток в различных средах",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Электростатика, 11 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Магнитное поле. Сила Лоренца.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Сила Ампера. Момент силы Ампера.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Закон Био-Савара-Лапласа",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Теорема Гаусса для магнитного поля",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Теорема о циркуляции магнитного поля",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Закон электромагнитной индукции Фарадея",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Движущийся проводник в магнитном поле",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Магнитная гидродинамика",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Эффект Холла",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Самоиндукция",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Энергия магнитного поля",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Электромагнетизм, 11 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Электромагнитные волны",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Интерференция и дифракция ЭМ волн",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Дисперсия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Импульс и энергия фотонов",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Фотоэффект",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Корпускулярно-волновой дуализм",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Соотношение неопределённостей Гейзенберга",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Переменный ток. Импеданс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Резонанс. Мощность переменного тока",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Переменный ток, 11 класc",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тепловое расширение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Количество теплоты, внутренняя энергия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Влажность",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Уравнение теплового баланса",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Внешние источники теплоты. Теплопотери.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Теплопроводность. Закон Ньютона-Рихмана.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Термодинамика, 8 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Длина свободного пробега",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Уравнение Клапейрона-Менделеева",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Работа, внутренняя энергия. Первое начало термодинамики.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Адиабатический процесс",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Политропический процесс",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Термодинамические циклы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Второе начало термодинамики. Две формулировки.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Цикл Карно",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Теоремы Карно",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Неравенство Клаузиуса",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Энтропия",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Влажный воздух",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Уравнение Клапейрона-Клаузиуса",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Неидеальные газы",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Тур. Термодинамика, 10 класс.",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Поверхностное натяжение",
    data: {
      section: "",
      grade: 0
    }
  },
  {
    id: "Равновесное тепловое излучение",
    data: {
      section: "",
      grade: 0
    }
  }
];

export const rawEdges = [
  {
    id: "e0",
    source: "TS",
    target: "Равномерное прямолинейное движение"
  },
  {
    id: "e1",
    source: "TS",
    target: "Плотность"
  },
  {
    id: "e2",
    source: "TS",
    target: "Работа с графиками"
  },
  {
    id: "e3",
    source: "TS",
    target: "Электрический заряд. Закон Кулона."
  },
  {
    id: "e4",
    source: "TS",
    target: "Температура. Связь температуры с кинетической энергией движения молекул."
  },
  {
    id: "e5",
    source: "TS",
    target: "Тень. Полутень."
  },
  {
    id: "e6",
    source: "Равномерное прямолинейное движение",
    target: "Средняя скорость. Относительное движение."
  },
  {
    id: "e7",
    source: "Средняя скорость. Относительное движение.",
    target: "Кинематические связи. Блоки."
  },
  {
    id: "e8",
    source: "Кинематические связи. Блоки.",
    target: "Закон Гука. Системы пружин."
  },
  {
    id: "e9",
    source: "Плотность",
    target: "Сила. Третий закон Ньютона."
  },
  {
    id: "e10",
    source: "Сила. Третий закон Ньютона.",
    target: "Сила тяжести"
  },
  {
    id: "e11",
    source: "Сила тяжести",
    target: "Закон Гука. Системы пружин."
  },
  {
    id: "e12",
    source: "Сила тяжести",
    target: "Давление. Сообщающиеся сосуды"
  },
  {
    id: "e13",
    source: "Закон Гука. Системы пружин.",
    target: "Моменты"
  },
  {
    id: "e14",
    source: "Закон Гука. Системы пружин.",
    target: "Работа. Мощность. КПД"
  },
  {
    id: "e15",
    source: "Моменты",
    target: "Системы блоков. Статика со связями."
  },
  {
    id: "e16",
    source: "Давление. Сообщающиеся сосуды",
    target: "Сила Архимеда"
  },
  {
    id: "e17",
    source: "Работа. Мощность. КПД",
    target: "Тур. Механика, 7 класс."
  },
  {
    id: "e18",
    source: "Системы блоков. Статика со связями.",
    target: "Тур. Механика, 7 класс."
  },
  {
    id: "e19",
    source: "Сила Архимеда",
    target: "Тур. Механика, 7 класс."
  },
  {
    id: "e20",
    source: "Тур. Механика, 7 класс.",
    target: "Энергия"
  },
  {
    id: "e21",
    source: "Тур. Механика, 7 класс.",
    target: "Движение со связями"
  },
  {
    id: "e22",
    source: "Тур. Механика, 7 класс.",
    target: "Равноускоренное движение"
  },
  {
    id: "e23",
    source: "Тур. Механика, 7 класс.",
    target: "Конус Маха"
  },
  {
    id: "e24",
    source: "Тур. Механика, 7 класс.",
    target: "Упругие столкновения с тяжёлой стенкой"
  },
  {
    id: "e25",
    source: "Энергия",
    target: "Метод виртуальных перемещений"
  },
  {
    id: "e26",
    source: "Энергия",
    target: "Бернулли"
  },
  {
    id: "e27",
    source: "Энергия",
    target: "Устойчивость равновесия"
  },
  {
    id: "e28",
    source: "Энергия",
    target: "Теорема Кёнига"
  },
  {
    id: "e29",
    source: "Энергия",
    target: "Динамика. Второй закон Ньютона."
  },
  {
    id: "e30",
    source: "Движение со связями",
    target: "Мгновенный центр вращения"
  },
  {
    id: "e31",
    source: "Мгновенный центр вращения",
    target: "Теорема Кёнига"
  },
  {
    id: "e32",
    source: "Равноускоренное движение",
    target: "Равномерное движение по окружности"
  },
  {
    id: "e33",
    source: "Равноускоренное движение",
    target: "Баллистика. Координатный метод."
  },
  {
    id: "e34",
    source: "Баллистика. Координатный метод.",
    target: "Баллистика. Векторный метод."
  },
  {
    id: "e35",
    source: "Баллистика. Векторный метод.",
    target: "Тур. Баллистика, 9 класс."
  },
  {
    id: "e36",
    source: "Равномерное движение по окружности",
    target: "Центростремительное ускорение"
  },
  {
    id: "e37",
    source: "Центростремительное ускорение",
    target: "Неравномерное движение по окружности"
  },
  {
    id: "e38",
    source: "Неравномерное движение по окружности",
    target: "Динамика. Второй закон Ньютона."
  },
  {
    id: "e39",
    source: "Динамика. Второй закон Ньютона.",
    target: "Всемирное тяготение. Космические скорости."
  },
  {
    id: "e40",
    source: "Динамика. Второй закон Ньютона.",
    target: "Неинерциальные системы отсчёта"
  },
  {
    id: "e41",
    source: "Динамика. Второй закон Ньютона.",
    target: "Сухое трение"
  },
  {
    id: "e42",
    source: "Динамика. Второй закон Ньютона.",
    target: "Импульс"
  },
  {
    id: "e43",
    source: "Неинерциальные системы отсчёта",
    target: "Вращательные НеИСО"
  },
  {
    id: "e44",
    source: "Сухое трение",
    target: "Вязкое трение"
  },
  {
    id: "e45",
    source: "Сухое трение",
    target: "Статика"
  },
  {
    id: "e46",
    source: "Импульс",
    target: "Реактивная сила"
  },
  {
    id: "e47",
    source: "Импульс",
    target: "Столкновения"
  },
  {
    id: "e48",
    source: "Столкновения",
    target: "Тур. Законы сохранения, 9 класс."
  },
  {
    id: "e49",
    source: "Реактивная сила",
    target: "Тур. Законы сохранения, 9 класс."
  },
  {
    id: "e50",
    source: "Всемирное тяготение. Космические скорости.",
    target: "Тур. Динамика, 9 класс."
  },
  {
    id: "e51",
    source: "Вращательные НеИСО",
    target: "Тур. Динамика, 9 класс."
  },
  {
    id: "e52",
    source: "Статика",
    target: "Тур. Динамика, 9 класс."
  },
  {
    id: "e53",
    source: "Тур. Динамика, 9 класс.",
    target: "Момент импульса"
  },
  {
    id: "e54",
    source: "Тур. Законы сохранения, 9 класс.",
    target: "Момент импульса"
  },
  {
    id: "e55",
    source: "Момент импульса",
    target: "Момент инерции"
  },
  {
    id: "e56",
    source: "Момент импульса",
    target: "Гравитация. Законы Кеплера."
  },
  {
    id: "e57",
    source: "Момент инерции",
    target: "Тур. Механика, 11 класс."
  },
  {
    id: "e58",
    source: "Гравитация. Законы Кеплера.",
    target: "Тур. Механика, 11 класс."
  },
  {
    id: "e59",
    source: "Устойчивость равновесия",
    target: "Гармонические колебания"
  },
  {
    id: "e60",
    source: "Гармонические колебания",
    target: "Энергия в гармонических колебаниях"
  },
  {
    id: "e61",
    source: "Энергия в гармонических колебаниях",
    target: "Затухающие колебания"
  },
  {
    id: "e62",
    source: "Затухающие колебания",
    target: "Резонанс"
  },
  {
    id: "e63",
    source: "Резонанс",
    target: "Сложение колебаний. Биения."
  },
  {
    id: "e64",
    source: "Сложение колебаний. Биения.",
    target: "Тур. Колебания, 11 класс"
  },
  {
    id: "e65",
    source: "Сложение колебаний. Биения.",
    target: "Механические волны"
  },
  {
    id: "e66",
    source: "Сложение колебаний. Биения.",
    target: "Постулаты специальной теории относительности"
  },
  {
    id: "e67",
    source: "Механические волны",
    target: "Эффект Доплера"
  },
  {
    id: "e68",
    source: "Постулаты специальной теории относительности",
    target: "Парадоксы и эффекты"
  },
  {
    id: "e69",
    source: "Парадоксы и эффекты",
    target: "Релятивистская динамика"
  },
  {
    id: "e70",
    source: "Работа с графиками",
    target: "Тригонометрия"
  },
  {
    id: "e71",
    source: "Тригонометрия",
    target: "Свойства тригонометрических функций"
  },
  {
    id: "e72",
    source: "Свойства тригонометрических функций",
    target: "Векторы"
  },
  {
    id: "e73",
    source: "Векторы",
    target: "Дифференцирование"
  },
  {
    id: "e74",
    source: "Дифференцирование",
    target: "Интегрирование"
  },
  {
    id: "e75",
    source: "Интегрирование",
    target: "Работа с малыми величинами"
  },
  {
    id: "e76",
    source: "Работа с малыми величинами",
    target: "Логарифмы, показательные функции"
  },
  {
    id: "e77",
    source: "Логарифмы, показательные функции",
    target: "Телесный угол"
  },
  {
    id: "e78",
    source: "Телесный угол",
    target: "Векторное произведение"
  },
  {
    id: "e79",
    source: "Векторное произведение",
    target: "Дифференциальные уравнения. Уравнения колебаний."
  },
  {
    id: "e80",
    source: "Дифференциальные уравнения. Уравнения колебаний.",
    target: "Ряды"
  },
  {
    id: "e81",
    source: "Ряды",
    target: "Комплексные числа"
  },
  {
    id: "e82",
    source: "Тень. Полутень.",
    target: "Отражение света. Зеркала."
  },
  {
    id: "e83",
    source: "Отражение света. Зеркала.",
    target: "Преломление света. Закон Снеллиуса."
  },
  {
    id: "e84",
    source: "Преломление света. Закон Снеллиуса.",
    target: "Пластины, призмы"
  },
  {
    id: "e85",
    source: "Пластины, призмы",
    target: "Полное внутреннее отражение"
  },
  {
    id: "e86",
    source: "Полное внутреннее отражение",
    target: "Линза, построение изображений"
  },
  {
    id: "e87",
    source: "Линза, построение изображений",
    target: "Формула тонкой линзы"
  },
  {
    id: "e88",
    source: "Формула тонкой линзы",
    target: "Увеличение"
  },
  {
    id: "e89",
    source: "Увеличение",
    target: "Оптические системы"
  },
  {
    id: "e90",
    source: "Оптические системы",
    target: "Тур. Оптика, 10 класс."
  },
  {
    id: "e91",
    source: "Тур. Оптика, 10 класс.",
    target: "Дисперсия"
  },
  {
    id: "e92",
    source: "Дисперсия",
    target: "Интерференция света. Когерентные источники."
  },
  {
    id: "e93",
    source: "Интерференция света. Когерентные источники.",
    target: "Интерференция света. Временная когерентность."
  },
  {
    id: "e94",
    source: "Интерференция света. Временная когерентность.",
    target: "Дифракция Фраунгофера"
  },
  {
    id: "e95",
    source: "Дифракция Фраунгофера",
    target: "Дифракция Френеля"
  },
  {
    id: "e96",
    source: "Дифракция Френеля",
    target: "Дифракционная решётка"
  },
  {
    id: "e97",
    source: "Дифракционная решётка",
    target: "Поляризация света"
  },
  {
    id: "e98",
    source: "Поляризация света",
    target: "Тур. Волновая оптика, 11 класс"
  },
  {
    id: "e99",
    source: "Электрический заряд. Закон Кулона.",
    target: "Напряжённость электрического поля, потенциал"
  },
  {
    id: "e100",
    source: "Напряжённость электрического поля, потенциал",
    target: "Сила тока, напряжение. Закон Ома."
  },
  {
    id: "e101",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Мощность электрического тока"
  },
  {
    id: "e102",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Удельное сопротивление"
  },
  {
    id: "e103",
    source: "Сила тока, напряжение. Закон Ома.",
    target: "Параллельное и последовательное соединения резисторов"
  },
  {
    id: "e104",
    source: "Мощность электрического тока",
    target: "Тур. Электричество, 8 класс."
  },
  {
    id: "e105",
    source: "Удельное сопротивление",
    target: "Тур. Электричество, 8 класс."
  },
  {
    id: "e106",
    source: "Параллельное и последовательное соединения резисторов",
    target: "Правила Кирхгофа"
  },
  {
    id: "e107",
    source: "Правила Кирхгофа",
    target: "Симметричные цепи"
  },
  {
    id: "e108",
    source: "Правила Кирхгофа",
    target: "Источники тока"
  },
  {
    id: "e109",
    source: "Симметричные цепи",
    target: "Метод наложения токов"
  },
  {
    id: "e110",
    source: "Источники тока",
    target: "Метод эквивалентного источника"
  },
  {
    id: "e111",
    source: "Источники тока",
    target: "Измерительные приборы"
  },
  {
    id: "e112",
    source: "Измерительные приборы",
    target: "Вольтамперная характеристика"
  },
  {
    id: "e113",
    source: "Измерительные приборы",
    target: "Мостовые схемы"
  },
  {
    id: "e114",
    source: "Мостовые схемы",
    target: "Преобразование звезда-треугольник"
  },
  {
    id: "e115",
    source: "Метод наложения токов",
    target: "Тур. Электричество, 8 класс."
  },
  {
    id: "e116",
    source: "Метод эквивалентного источника",
    target: "Тур. Электричество, 8 класс."
  },
  {
    id: "e117",
    source: "Вольтамперная характеристика",
    target: "Тур. Электричество, 8 класс."
  },
  {
    id: "e118",
    source: "Преобразование звезда-треугольник",
    target: "Тур. Электричество, 8 класс."
  },
  {
    id: "e119",
    source: "Тур. Электричество, 8 класс.",
    target: "Поток электрического поля. Закон Гаусса."
  },
  {
    id: "e120",
    source: "Поток электрического поля. Закон Гаусса.",
    target: "Рассчёт электрического поля и потенциала"
  },
  {
    id: "e121",
    source: "Рассчёт электрического поля и потенциала",
    target: "Принцип суперпозиции"
  },
  {
    id: "e122",
    source: "Принцип суперпозиции",
    target: "Проводники в электростатическом поле"
  },
  {
    id: "e123",
    source: "Проводники в электростатическом поле",
    target: "Теорема о единственности"
  },
  {
    id: "e124",
    source: "Теорема о единственности",
    target: "Метод электростатических изображений"
  },
  {
    id: "e125",
    source: "Метод электростатических изображений",
    target: "Энергия систем зарядов"
  },
  {
    id: "e126",
    source: "Энергия систем зарядов",
    target: "Диэлектрики в электростатическом поле"
  },
  {
    id: "e127",
    source: "Диэлектрики в электростатическом поле",
    target: "Тур. Электростатика, 10 класс."
  },
  {
    id: "e128",
    source: "Тур. Электростатика, 10 класс.",
    target: "Конденсаторы"
  },
  {
    id: "e129",
    source: "Конденсаторы",
    target: "Соединение конденсаторов. Энергия конденсатора."
  },
  {
    id: "e130",
    source: "Соединение конденсаторов. Энергия конденсатора.",
    target: "Объёмная плотность энергии электрического поля"
  },
  {
    id: "e131",
    source: "Объёмная плотность энергии электрического поля",
    target: "RC-цепи"
  },
  {
    id: "e132",
    source: "RC-цепи",
    target: "Ток в различных средах"
  },
  {
    id: "e133",
    source: "Ток в различных средах",
    target: "Тур. Электростатика, 11 класс."
  },
  {
    id: "e134",
    source: "Тур. Электростатика, 11 класс.",
    target: "Магнитное поле. Сила Лоренца."
  },
  {
    id: "e135",
    source: "Магнитное поле. Сила Лоренца.",
    target: "Сила Ампера. Момент силы Ампера."
  },
  {
    id: "e136",
    source: "Сила Ампера. Момент силы Ампера.",
    target: "Закон Био-Савара-Лапласа"
  },
  {
    id: "e137",
    source: "Закон Био-Савара-Лапласа",
    target: "Теорема Гаусса для магнитного поля"
  },
  {
    id: "e138",
    source: "Теорема Гаусса для магнитного поля",
    target: "Теорема о циркуляции магнитного поля"
  },
  {
    id: "e139",
    source: "Теорема о циркуляции магнитного поля",
    target: "Закон электромагнитной индукции Фарадея"
  },
  {
    id: "e140",
    source: "Закон электромагнитной индукции Фарадея",
    target: "Движущийся проводник в магнитном поле"
  },
  {
    id: "e141",
    source: "Движущийся проводник в магнитном поле",
    target: "Магнитная гидродинамика"
  },
  {
    id: "e142",
    source: "Магнитная гидродинамика",
    target: "Эффект Холла"
  },
  {
    id: "e143",
    source: "Эффект Холла",
    target: "Самоиндукция"
  },
  {
    id: "e144",
    source: "Самоиндукция",
    target: "Энергия магнитного поля"
  },
  {
    id: "e145",
    source: "Энергия магнитного поля",
    target: "Тур. Электромагнетизм, 11 класс."
  },
  {
    id: "e146",
    source: "Тур. Электромагнетизм, 11 класс.",
    target: "Электромагнитные волны"
  },
  {
    id: "e147",
    source: "Тур. Электромагнетизм, 11 класс.",
    target: "Переменный ток. Импеданс."
  },
  {
    id: "e148",
    source: "Электромагнитные волны",
    target: "Интерференция и дифракция ЭМ волн"
  },
  {
    id: "e149",
    source: "Интерференция и дифракция ЭМ волн",
    target: "Дисперсия"
  },
  {
    id: "e150",
    source: "Интерференция и дифракция ЭМ волн",
    target: "Импульс и энергия фотонов"
  },
  {
    id: "e151",
    source: "Импульс и энергия фотонов",
    target: "Фотоэффект"
  },
  {
    id: "e152",
    source: "Фотоэффект",
    target: "Корпускулярно-волновой дуализм"
  },
  {
    id: "e153",
    source: "Корпускулярно-волновой дуализм",
    target: "Соотношение неопределённостей Гейзенберга"
  },
  {
    id: "e154",
    source: "Переменный ток. Импеданс.",
    target: "Резонанс. Мощность переменного тока"
  },
  {
    id: "e155",
    source: "Резонанс. Мощность переменного тока",
    target: "Тур. Переменный ток, 11 класc"
  },
  {
    id: "e156",
    source: "Температура. Связь температуры с кинетической энергией движения молекул.",
    target: "Тепловое расширение"
  },
  {
    id: "e157",
    source: "Температура. Связь температуры с кинетической энергией движения молекул.",
    target: "Количество теплоты, внутренняя энергия"
  },
  {
    id: "e158",
    source: "Количество теплоты, внутренняя энергия",
    target: "Влажность"
  },
  {
    id: "e159",
    source: "Количество теплоты, внутренняя энергия",
    target: "Уравнение теплового баланса"
  },
  {
    id: "e160",
    source: "Уравнение теплового баланса",
    target: "Внешние источники теплоты. Теплопотери."
  },
  {
    id: "e161",
    source: "Внешние источники теплоты. Теплопотери.",
    target: "Теплопроводность. Закон Ньютона-Рихмана."
  },
  {
    id: "e162",
    source: "Теплопроводность. Закон Ньютона-Рихмана.",
    target: "Тур. Термодинамика, 8 класс."
  },
  {
    id: "e163",
    source: "Влажность",
    target: "Тур. Термодинамика, 8 класс."
  },
  {
    id: "e164",
    source: "Тепловое расширение",
    target: "Тур. Термодинамика, 8 класс."
  },
  {
    id: "e165",
    source: "Тур. Термодинамика, 8 класс.",
    target: "Длина свободного пробега"
  },
  {
    id: "e166",
    source: "Длина свободного пробега",
    target: "Уравнение Клапейрона-Менделеева"
  },
  {
    id: "e167",
    source: "Уравнение Клапейрона-Менделеева",
    target: "Работа, внутренняя энергия. Первое начало термодинамики."
  },
  {
    id: "e168",
    source: "Работа, внутренняя энергия. Первое начало термодинамики.",
    target: "Адиабатический процесс"
  },
  {
    id: "e169",
    source: "Адиабатический процесс",
    target: "Политропический процесс"
  },
  {
    id: "e170",
    source: "Политропический процесс",
    target: "Термодинамические циклы"
  },
  {
    id: "e171",
    source: "Термодинамические циклы",
    target: "Второе начало термодинамики. Две формулировки."
  },
  {
    id: "e172",
    source: "Второе начало термодинамики. Две формулировки.",
    target: "Цикл Карно"
  },
  {
    id: "e173",
    source: "Цикл Карно",
    target: "Теоремы Карно"
  },
  {
    id: "e174",
    source: "Теоремы Карно",
    target: "Неравенство Клаузиуса"
  },
  {
    id: "e175",
    source: "Теоремы Карно",
    target: "Влажный воздух"
  },
  {
    id: "e176",
    source: "Неравенство Клаузиуса",
    target: "Энтропия"
  },
  {
    id: "e177",
    source: "Влажный воздух",
    target: "Уравнение Клапейрона-Клаузиуса"
  },
  {
    id: "e178",
    source: "Уравнение Клапейрона-Клаузиуса",
    target: "Неидеальные газы"
  },
  {
    id: "e179",
    source: "Неидеальные газы",
    target: "Тур. Термодинамика, 10 класс."
  },
  {
    id: "e180",
    source: "Энтропия",
    target: "Тур. Термодинамика, 10 класс."
  },
  {
    id: "e181",
    source: "Тур. Термодинамика, 10 класс.",
    target: "Поверхностное натяжение"
  },
  {
    id: "e182",
    source: "Поверхностное натяжение",
    target: "Равновесное тепловое излучение"
  }
];
